Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
unsigned char OFRequestFilling;
unsigned char VFVibEngagePneuValveVibratorMode;
unsigned long int VFVibEngageVibratorPeriod, VFVibEngageVibratorPeriodCounter;
unsigned long int VFVibEngageVibratorFrequency, VFVibEngageVibratorDutyCycle;
unsigned int VFVibratorEngageDelay, VFVibratorEngageDelayCounter;
unsigned int VFVibratorEngageVibDelay, VFVibratorEngageVibDelayCounter;

/* Sealing Module & Vibrator Sealer Module */
unsigned int SPSealerPneuRetSensor, SPSealerPneuExtSensor, SPVibEngagePneuRetSensor, SPVibEngagePneuExtSensor;
unsigned int SPPusherPneuRetSensor, SPPusherPneuExtSensor;

unsigned char SPSealerPneuValve, SPSealerPneuValveMON, SPVibEngagePneuValve, SPVibEngagePneuValveMON;
unsigned char SPPusherValve, SPPusherValveMON, SPVibrator, SPVibratorMON;

unsigned int SPSealerPneuValveDuration,	SPSealerPneuValveDelay, SPSealerPneuValveDurationCounter, SPSealerPneuValveDelayCounter;
unsigned char SPModuleStep;

unsigned char SPSbsMON, LastSPSbsMON, SPModMON, LastSPModMON;

/* Weigher Module */
unsigned int LHopperSensor, RHopperSensor;

unsigned char WLLrGatePneuValve, WLLrGatePneuValveMON, WLSmGatePneuValve, WLSmGatePneuValveMON;
unsigned char WLOpGatePneuValve, WLOpGatePneuValveMON, WRLrGatePneuValve, WRLrGatePneuValveMON;
unsigned char WRSmGatePneuValve, WRSmGatePneuValveMON, WROpGatePneuValve, WROpGatePneuValveMON;

unsigned int WLOpGatePneuDuration, WROpGatePneuDuration, WNextOpGateDelay;
unsigned int WLOpGatePneuDurationCounter, WROpGatePneuDurationCounter, WNextOpGateDelayCounter;
signed long int WLCLSDARatioCustomKg, WLCRSDARatioCustomKg, WLCLSDAReadingOffset, WLCRSDAReadingOffset;
signed long int WLCLSDARatioCustomKgCO, WLCRSDARatioCustomKgCO, WLCLSDAReadingOffsetCO, WLCRSDAReadingOffsetCO;
signed long int WLCLDispWeight, WLCRDispWeight, WLCLSDAReading, WLCRSDAReading;

signed long int WLCLSDAReadingCustomKg, WLCLSDAReadingAverage, WLCLSDAReadingZero, WLCLSDAReadingTemp;
signed long int WLCLSDAReadingBuffer[32];
unsigned char WLCLCalibrationMode, WLCLSDAAverageCounter, WLCLLoadSampling = 1, WLCLWaitingMode;
unsigned char WLCLSCLCounter;

signed long int WLCRSDAReadingCustomKg, WLCRSDAReadingAverage, WLCRSDAReadingZero, WLCRSDAReadingTemp;
signed long int WLCRSDAReadingBuffer[32];
unsigned char WLCRCalibrationMode, WLCRSDAAverageCounter, WLCRLoadSampling = 1, WLCRWaitingMode;
unsigned char WLCRSCLCounter;

signed int WLCLTargetWeight, WLCRTargetWeight, WLCLCorrectionWeight, WLCRCorrectionWeight;
signed int WLCLSlowAt, WLCRSlowAt;
unsigned long int WCustomKg;
unsigned char WLCLOnZeroingBtn, WLCROnZeroingBtn, LastWLCLOnZeroingBtn, LastWLCROnZeroingBtn;
unsigned char WLCLCalibrationFlag, WLCRCalibrationFlag, WLCLCalibrationFlagCounter, WLCRCalibrationFlagCounter;

unsigned char WLCLOnZeroingBtn, WLCROnZeroingBtn, WLCLWeightOK, WLCRWeightOK;
unsigned char WLCLWeightOKFlag, WLCRWeightOKFlag, WLCLWeightOKCounter, WLCRWeightOKCounter;

signed long int WLCLTempReading, WLCLSDAReadingNormalised, WLCRTempReading, WLCRSDAReadingNormalised;
unsigned char WZeroMON, WLCLZeroMONFlag, WLCRZeroMONFlag;
unsigned int WLCLZeroDelayCounter, WLCRZeroDelayCounter;
unsigned char i;

unsigned char WSoloEnable, LastWSoloEnable, WSoloOpenGate;
unsigned char WLCNextGatePriority;

/* External Heater Module */
unsigned int HeaterErrorCounter, HeaterErrorMsgDuration;
unsigned char HeaterError, HeaterErrorMsg;

/* Auxiliaries */
unsigned char TowerLightGreen, TowerLightYellow, TowerLightRed;
unsigned char LastTRModuleStep, LastGTModuleStep, LastOFModuleStep, LastSPModuleStep;
unsigned int TRModuleStepCounter, GTModuleStepCounter, OFModuleStepCounter, SPModuleStepCounter;
//*****************************************************************************
// Interrupt handler for the SSI0 interrupt
//*****************************************************************************
void IntSSI0(void)
{
	SSIIntClear(SSI0_BASE, SSI_TXFF | SSI_RXFF | SSI_RXTO | SSI_RXOR );
	SSIDataGetNonBlocking(SSI0_BASE, &SPIIn[SPICounter]);//SPIIn[SPICounter] = SPDR;
	//PORTSS = TRUE;
	switch(SPICounter)
	{
		case 0:
			if(SPIIn[0] != 0xF0)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
		break;
		case 1:
			if(SPIIn[1] != 0x64)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
			break;
		case 2:
			if(SPIIn[2] != 0x04)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
			break;
		case 24:
			if(SPIIn[24] != 0x0F)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
			break;
		case 25:
			if(SPIIn[25] != 0x0F)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
	}

	if(SPICounter >= 25)                              // SPI Communication has read all the frame successfully
	{
		if(SPIComErrorFlag)		// First Cycle After SPI Transmission Succeeded
		{
			SPIFirstCycleDurationCounter = 1000;
		}
		SPIComErrorFlag = FALSE;

		ITTrayPosLeftSensor =        	SPIIn[3] % 2;
		ITTrayPosRightSensor =       	(SPIIn[3] >> 1) % 2;
		ITTrayElevationMaxSensor =      (SPIIn[3] >> 2) % 2;
		ITTrayElevationMinSensor =      (SPIIn[3] >> 3) % 2;
		ITLeftMaterialAvailableSensor = (SPIIn[3] >> 4) % 2;	// Active High From Slave
		ITLeftMaterialNotAvailableSensor = (SPIIn[3] >> 5) % 2;

		GTInFillGripPneuLRetSensor 	=   SPIIn[4] % 2;
		GTInFillGripPneuRRetSensor 	=   (SPIIn[4] >> 1) % 2;
		GTOutFillOpenPneuLRetSensor	=   (SPIIn[4] >> 2) % 2;
		GTOutFillOpenPneuRRetSensor	=   (SPIIn[4] >> 3) % 2;
		GTOutFillOpenPneuLExtSensor	=   (SPIIn[4] >> 4) % 2;
		GTOutFillOpenPneuRExtSensor	=   (SPIIn[4] >> 5) % 2;
		GTOutFillGripPneuLRetSensor	=   (SPIIn[4] >> 6) % 2;
		GTOutFillGripPneuRRetSensor	=   (SPIIn[4] >> 7) % 2;
		GTTransferPneuRetSensor		=   SPIIn[5] % 2;
		GTTransferPneuExtSensor		=   (SPIIn[5] >> 1) % 2;

		VFVibEngagePneuRetSensor	=   SPIIn[6] % 2;
		VFVibEngagePneuExtSensor	=   (SPIIn[6] >> 1) % 2;

		SPVibEngagePneuRetSensor	=   SPIIn[7] % 2;
		SPVibEngagePneuExtSensor	=   (SPIIn[7] >> 1) % 2;
		SPPusherPneuRetSensor		=   (SPIIn[7] >> 2) % 2;
		SPPusherPneuExtSensor		=   (SPIIn[7] >> 3) % 2;

