Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
		SlavePortA = SPIIn[8];
		SlavePortB = SPIIn[9];
		SlavePortC = SPIIn[10];
		SlavePortD = SPIIn[11];
		SlavePortE = SPIIn[12];
		SlavePortF = SPIIn[13];
		SlavePortG = SPIIn[14];
		SlavePortH = SPIIn[15];
		SlavePortI = SPIIn[16];
		SlavePortJ = SPIIn[17];

		SPICounter = 0;
		SPICounterSkip = TRUE;
		SPIDataLock = FALSE;
	}

	if(SPICounterSkip)
		SPICounterSkip = FALSE;
	else
		SPICounter++;

	SPITransmitted = FALSE;
}

//*****************************************************************************
// Interrupt handler for the UART0 interrupt
//*****************************************************************************
void UART0IntHandler(void)
{
    unsigned long ulStatus;

    // Get the interrupt status.
    ulStatus = ROM_UARTIntStatus(UART0_BASE, true);

    // Clear the asserted interrupts.
    ROM_UARTIntClear(UART0_BASE, ulStatus);

    // Loop while there are characters in the receive FIFO.
    if( (ulStatus & UART_INT_RX) == UART_INT_RX )
    {
		if(ROM_UARTCharsAvail(UART0_BASE))
		{
			if(!ReadACK)
			{
				ComIN[dataRXIndex] = ROM_UARTCharGetNonBlocking(UART0_BASE);
	            switch(dataRXIndex)
	            {
	                case 0:                                         // 0x0F
	                    break;
	                case 1:             // station number
	                    if(ComIN[1] != 0x01)
	                        dataRXIndex = 0;
	                    break;
	                case 2:             // function number
	                    if(ComIN[2] != 0x03)
	                        dataRXIndex = 0;
	                    break;
	                case 3:
	                    ComAddress = ComIN[3];
	                    break;
	                case 4:
	                    BytestoRead = ComIN[4];
	                    break;
	                case 5:             // Vibrator Counter Setting
	                    if(ComAddress == 1)
	                    {
	                    	if(!MachineRunning)
	                    	{
								ServiceMode = 				ComIN[5] % 2;
								ITMotorTrayElevatorMON =    (ComIN[5] >> 1) % 2;
								ITMotorTrayElevatorDirMON = (ComIN[5] >> 2) % 2;                                          // Vibrator ON/OFF
								ITValveTrayPosMON =   		(ComIN[5] >> 3) % 2;
								TRExtenderPneuValveMON =    (ComIN[5] >> 4) % 2;
								TRReorientPneuValveMON =    (ComIN[5] >> 5) % 2;
								TRVacuumValveMON = 			(ComIN[5] >> 6) % 2;
								TRFoilPusherValveMON = 		(ComIN[5] >> 7) % 2;
	                    	}
	                    }
	                    break;
	                case 6:
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                    	{
	                        	GTInFillGripPneuValveMON =	ComIN[6] % 2;
	                        	GTOutFillOpenPneuValveMON = (ComIN[6] >> 1) % 2;
	                        	GTOutFillGripPneuValveMON = (ComIN[6] >> 2) % 2;
	                        	GTTransferPneuValveMON =    (ComIN[6] >> 3) % 2;
	                        	OFGatePneuValveMON =     	(ComIN[6] >> 4) % 2;
	                        	OFEngagePneuValveMON =     	(ComIN[6] >> 5) % 2;
	                        	OFOpenPneuValveMON = 		(ComIN[6] >> 6) % 2;
	                        	OFVacuumValveMON  = 		(ComIN[6] >> 7) % 2;
	                        }
	                    }
	                    break;
	                case 7:
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                    	{
	                        	VFVibEngagePneuValveMON =  	ComIN[7] % 2;
	                        	VFVibratorMON = 			(ComIN[7] >> 1) % 2;
	                        	SPSealerPneuValveMON =   	(ComIN[7] >> 2) % 2;
	                        	SPVibEngagePneuValveMON = 	(ComIN[7] >> 3) % 2;
	                        	SPPusherValveMON = 			(ComIN[7] >> 4) % 2;
	                        	SPVibratorMON = 			(ComIN[7] >> 5) % 2;
	                        	WLLrGatePneuValveMON = 		(ComIN[7] >> 6) % 2;
	                        	WLSmGatePneuValveMON = 		(ComIN[7] >> 7) % 2;
	                        }
	                    }
	                    break;
	                case 8:
	                    if(ComAddress == 1)
	                    {
	                    	WLOpGatePneuValveMON = 	ComIN[8] % 2;
	                    	WRLrGatePneuValveMON =	(ComIN[8] >> 1) % 2;                                          // Vibrator ON/OFF
	                    	WRSmGatePneuValveMON = 	(ComIN[8] >> 2) % 2;
	                    	WROpGatePneuValveMON = 	(ComIN[8] >> 3) % 2;
	                    	//RunBtn = 				(ComIN[8] >> 4) % 2;
	                    	//StopBtn =				(ComIN[8] >> 5) % 2;
	                    	if( LastWLCLOnZeroingBtn != ((ComIN[8] >> 6) % 2) )
	                    		WLCLOnZeroingBtn =		(ComIN[8] >> 6) % 2;
	                    	LastWLCLOnZeroingBtn = (ComIN[8] >> 6) % 2;

	                    	if( LastWLCROnZeroingBtn != ((ComIN[8] >> 7) % 2) )
	                    		WLCROnZeroingBtn =		(ComIN[8] >> 7) % 2;
	                    	LastWLCROnZeroingBtn = (ComIN[8] >> 7) % 2;
	                    }
	                    break;
	                case 9:
	                    if(ComAddress == 1)
	                    {
	                    	ITEnable = 					ComIN[9] % 2;
	                    	ITMotorTrayElevatorDirSet =	(ComIN[9] >> 1) % 2;
	                    	WSoloEnable =				(ComIN[9] >> 2) % 2;
	                    	WZeroMON =					(ComIN[9] >> 3) % 2;
	                    	IgnoreAirError =			(ComIN[9] >> 4) % 2;
	                    	IgnoreTRVacuumSensor = 		(ComIN[9] >> 5) % 2;
	                    	ITOverride = 				(ComIN[9] >> 6) % 2;
	                    	if( LastInitMON != ((ComIN[9] >> 7) % 2) )
								InitMON =		(ComIN[9] >> 7) % 2;
							LastInitMON = (ComIN[9] >> 7) % 2;
	                    }
	                    break;
	                case 10:
	                    if(ComAddress == 1)
	                    {
	                    	// Step by Step
	                    	if( LastTRSbsMON != (ComIN[10] % 2) )
	                    		TRSbsMON =		ComIN[10] % 2;
	                    	LastTRSbsMON = ComIN[10] % 2;
	                    	if( LastGTSbsMON != ((ComIN[10] >> 1) % 2) )
								GTSbsMON =		(ComIN[10] >> 1) % 2;
							LastGTSbsMON = (ComIN[10] >> 1) % 2;
	                    	if( LastOFSbsMON != ((ComIN[10] >> 2) % 2) )
								OFSbsMON =		(ComIN[10] >> 2) % 2;
							LastOFSbsMON = (ComIN[10] >> 2) % 2;
	                    	if( LastSPSbsMON != ((ComIN[10] >> 3) % 2) )
								SPSbsMON =		(ComIN[10] >> 3) % 2;
							LastSPSbsMON = (ComIN[10] >> 3) % 2;

							// Module by module
	                    	if( LastTRModMON != ((ComIN[10] >> 4) % 2) )
	                    		TRModMON =		(ComIN[10] >> 4) % 2;
	                    	LastTRModMON = (ComIN[10] >> 4) % 2;
	                    	if( LastGTModMON != ((ComIN[10] >> 5) % 2) )
								GTModMON =		(ComIN[10] >> 5) % 2;
							LastGTModMON = (ComIN[10] >> 5) % 2;
	                    	if( LastOFModMON != ((ComIN[10] >> 6) % 2) )
								OFModMON =		(ComIN[10] >> 6) % 2;
							LastOFModMON = (ComIN[10] >> 6) % 2;
	                    	if( LastSPModMON != ((ComIN[10] >> 7) % 2) )
								SPModMON =		(ComIN[10] >> 7) % 2;
							LastSPModMON = (ComIN[10] >> 7) % 2;
	                    }
	                    break;
	                case 11:
	                    if(ComAddress == 1)
	                    {
	                    	TRVacuumValveDelay = ComIN[11] * 10;
	                    }
	                    break;
	                case 12:
	                    if(ComAddress == 1)
	                    {
	                    	GTCloseBagDelay = ComIN[12] * 10;
	                    }
	                    break;
	                case 13:
	                    if(ComAddress == 1)
	                    {
	                    	GTBothOpenGripDelay = ComIN[13] * 10;
	                    }
	                    break;
	                case 14:
	                    if(ComAddress == 1)
	                    {
	                    	OFGatePneuValveDuration = ComIN[14] * 10;
	                    }
	                    break;
	                case 15:
	                    if(ComAddress == 1)
	                    {
	                    	OFVacuumValveDelay = ComIN[15] * 10;
	                    }
	                    break;
	                case 16:
	                    if(ComAddress == 1)
	                    {
	                    	SPSealerPneuValveDuration = ComIN[16] * 10;
	                    }
	                    break;
	                case 17:
	                    if(ComAddress == 1)
	                    {
	                    	SPSealerPneuValveDelay = ComIN[17] * 10;
	                    }
	                    break;
	                case 18:
	                    if(ComAddress == 1)
	                    {
	                    	WLOpGatePneuDuration = ComIN[18] * 100;
	                    }
	                    break;
	                case 19:
	                    if(ComAddress == 1)
	                    {
	                    	WROpGatePneuDuration = ComIN[19] * 100;
	                    }
	                    break;
	                case 20:
	                    if(ComAddress == 1)
	                    {
	                    	WNextOpGateDelay = ComIN[20] * 10;
	                    }
	                    break;
	                case 24:
	                    if(ComAddress == 1)
	                    {
	                    	WLCLSDARatioCustomKg = (ComIN[21] << 24) + (ComIN[22] << 16) + (ComIN[23] << 8) + ComIN[24];
	                    }
	                    break;
	                case 28:
	                    if(ComAddress == 1)
	                    {
	                    	WLCRSDARatioCustomKg = (ComIN[25] << 24) + (ComIN[26] << 16) + (ComIN[27] << 8) + ComIN[28];
	                    }
	                    break;
	                case 32:
	                    if(ComAddress == 1)
	                    {
	                    	WLCLSDAReadingOffset = (ComIN[29] << 24) + (ComIN[30] << 16) + (ComIN[31] << 8) + ComIN[32];
	                    }
	                    break;
	                case 36:
	                    if(ComAddress == 1)
	                    {
	                    	WLCRSDAReadingOffset = (ComIN[33] << 24) + (ComIN[34] << 16) + (ComIN[35] << 8) + ComIN[36];
	                    }
	                    break;
	                case 38:
	                    if(ComAddress == 1)
	                    {
	                    	WLCLTargetWeight = (ComIN[37] << 8) + ComIN[38];
	                    }
	                    break;
	                case 40:
	                    if(ComAddress == 1)
	                    {
	                    	WLCRTargetWeight = (ComIN[39] << 8) + ComIN[40];
	                    }
	                    break;
	                case 42:
	                    if(ComAddress == 1)
	                    {
	                    	WLCLCorrectionWeight = (ComIN[41] << 8) + ComIN[42];
	                    }
	                    break;
	                case 44:
	                    if(ComAddress == 1)
	                    {
	                    	WLCRCorrectionWeight = (ComIN[43] << 8) + ComIN[44];
	                    }
	                    break;
	                case 46:
	                    if(ComAddress == 1)
	                    {
	                    	WLCLSlowAt = (ComIN[45] << 8) + ComIN[46];
	                    }
	                    break;
	                case 48:
	                    if(ComAddress == 1)
	                    {
	                    	WLCRSlowAt = (ComIN[47] << 8) + ComIN[48];
	                    }
	                    break;
	                case 50:
	                    if(ComAddress == 1)
	                    {
	                    	WCustomKg = ((ComIN[49] << 8) + ComIN[50]) * 10;
	                    }
	                    break;
	                case 51:
	                    if(ComAddress == 1)
	                    {
	                    	HMICurrentWindow = ComIN[51];
	                    	if(HMILastWindow != HMICurrentWindow)
	                    	{
	                    		// LEFT LOADCELL
	                    		// If going from Calibration page 1 -> page 2
	                    		if((HMICurrentWindow == 37) && (HMILastWindow == 36) )
	                    			WLCLCalibrationMode = 1;
	                    		// If going from Calibration page 2 -> Main Calibration Page
	                    		if((HMICurrentWindow == 40) && (HMILastWindow == 37) )
	                    			WLCLCalibrationMode = 2;

