Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
	                    		// RIGHT LOADCELL
	                    		// If going from Calibration page 1 -> page 2
	                    		if((HMICurrentWindow == 39) && (HMILastWindow == 38) )
	                    			WLCRCalibrationMode = 1;
	                    		// If going from Calibration page 2 -> Main Calibration Page
	                    		if((HMICurrentWindow == 40) && (HMILastWindow == 39) )
	                    			WLCRCalibrationMode = 2;
	                    	}
	                    	HMILastWindow = HMICurrentWindow;
	                    }
	                    break;
	                case 52:
	                    if(ComAddress == 1)
	                    {
	                    	GTFPushPneuValveDuration = ComIN[52] * 10;
	                    }
	                    break;
	                case 54:
	                    if(ComAddress == 1)
	                    {
	                    	if(!Initting)
	                    		BufferSensor = (ComIN[53] << 8) + ComIN[54];
	                    	else
	                    		BufferSensor = 120;
	                    }
	                    break;
	                case 55:
	                    if(ComAddress == 1)
	                    {
	                    	VFVibEngageVibratorFrequency = ComIN[55];
	                    	if(VFVibEngageVibratorFrequency)
	                    		VFVibEngageVibratorPeriod = 10000 / VFVibEngageVibratorFrequency; // 1 (0.1hz) = 10000 ms
	                    	else
	                    		VFVibEngageVibratorPeriod = 0;		// Means DISACTIVATE VIBRATION MODE
	                    }
	                    break;
	                case 56:
	                    if(ComAddress == 1)
	                    {
	                    	if(ComIN[56])
	                    		VFVibEngageVibratorDutyCycle = ComIN[56];
	                    	else
	                    		VFVibEngageVibratorDutyCycle = 50;
	                    }
	                    break;
	                case 57:
	                    if(ComAddress == 1)
	                    {
	                    	if( (!WLOpGatePneuDurationCounter) && (!WROpGatePneuDurationCounter) )
	                    		WSoloOpenGate = ComIN[57] % 2;
	                    	else
	                    		WSoloOpenGate = FALSE;
	                    	//ITMotorTrayElevatorDirSet =	(ComIN[9] >> 1) % 2;
	                    }
	                    break;
	                case 58:
	                    if(ComAddress == 1)
	                    {
	                    	VFVibratorEngageDelay = ComIN[58] * 10;
	                    }
	                    break;
	                case 59:
	                    if(ComAddress == 1)
	                    {
	                    	VFVibratorEngageVibDelay = ComIN[59] * 10;
	                    }
	                    break;
	                case 90:	// case 90 - 98 is for Direct PORTOUT  PORTA = 90, PORTJ = 98
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 91:	// PORTB
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 92:	// PORTC
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 93:	// PORTD
	                    if(ComAddress == 1)
	                    {

	                    }
	                    break;
	                case 96:	// PORTG
	                    if(ComAddress == 1)
	                    {

	                    }
	                    break;
	                case 98:	// PORTJ
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 99:
	                    if(ComAddress == 1)
	                    {
	                    }
	                    break;
	                case 101:
	                    if(ComAddress == 1)
	                    {
	                    }
	                    break;

	            }
				if(dataRXIndex == 109)
				{
					UARTTimeOut = UARTDISABLEDCOUNT;
                    ComAddress = ComIN[3];
                    BytestoRead = ComIN[4];
					ReadACK = TRUE;
					dataTXIndex = ComAddress * 20;
					dataRXIndex = 0;
	                //ROM_UARTCharPutNonBlocking(UART0_BASE, ComOUT[dataTXIndex]);
	                //dataTXIndex++;
					IntRXCounter++;
					ComFlag = TRUE;                         // Have communicated with TouchScreen Successfully
				}

				if( (ComIN[0] != 0xF0) || (ReadACK == TRUE) )
				{
					dataRXIndex = 0;
					//debugcounter1++;
				}
				else
					dataRXIndex++;
			}
		}
    }


    // Interrupt Transmit Handler
    if( (ulStatus & UART_INT_TX) == UART_INT_TX )
    {
    }
}

//*****************************************************************************
// Interrupt handler for the LD_DATA interrupt
//*****************************************************************************
void IntGPIOd(void)
{
	ROM_GPIOPinIntClear(PIN_W_LCR_DATA_BASE, PIN_W_LCR_DATA_PIN);
    if(WLCRWaitingMode)
    	WLCRWaitingMode = FALSE;
}
void IntGPIOe(void)
{
	ROM_GPIOPinIntClear(PIN_W_LCL_DATA_BASE, PIN_W_LCL_DATA_PIN);
    if(WLCLWaitingMode)
    	WLCLWaitingMode = FALSE;
}

//*****************************************************************************
// Interrupt handler for the Timer0 interrupt
//*****************************************************************************
void Timer0IntHandler(void)
{

    // Clear the timer interrupt.
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);

    LoopTime = LoopCycle;
    LoopCycle = 0;

    // ITValvePos Initialization to avoid crash
    if(SPIFirstCycleDurationCounter)
    {
    	SPIFirstCycleDurationCounter--;
    	if(!ITTrayPosLeftSensor)
    		ITValveTrayPos = TRUE;
    	if(!ITTrayPosRightSensor)
    		ITValveTrayPos = FALSE;
    }
    // ZEROING WEIGHER
    if( WZeroMON && (!MachineRunning) && (!Initting) )
    {
    	if( (!WLCLZeroMONFlag) && (!WLCRZeroMONFlag) )
    	{
    		WLCLZeroMONFlag = TRUE;
    		WLCRZeroMONFlag = TRUE;
			WLOpGatePneuDurationCounter = WLOpGatePneuDuration;
			WROpGatePneuDurationCounter = WROpGatePneuDuration;
    	}
    }
    // Tower Light Subroutine
    // Machine Running :
    // Green if machine active and steps keep running
    // Blinking Yellow if Machine Stopping OR the Steps are stuck somewhere
    // Machine Not Running :
    // Yellow if machine is okay, just waiting to be run
    // Blinking Red if there are errors
    if(MachineRunning)
    {
    	if( (!TRModuleStepCounter) && (!GTModuleStepCounter) &&
    			(!OFModuleStepCounter) && (!SPModuleStepCounter) )
    	{
    		TowerLightGreen = FALSE;
    		TowerLightYellow = BlinkFlag;
    	}
    	else if( MachineStopping )
    	{
    		TowerLightGreen = FALSE;
    		TowerLightYellow = BlinkFlag;
    	}
    	else
    	{
    		TowerLightGreen = TRUE;
    		TowerLightYellow = FALSE;
    	}
    }
    else
    {
    	TowerLightGreen = FALSE;
    	if(Error || FatalError)
    	{
    		TowerLightYellow = FALSE;
    		TowerLightRed = BlinkFlag;
    	}
    	else
    	{
    		TowerLightYellow = TRUE;
    		TowerLightRed = FALSE;
    	}
    }

    // if EVERY module step got stuck for 5 seconds, then the yellow light will start blinking
    // Meaning 1. out of product 2. out of foil 3. Sensors not responding
    if(LastTRModuleStep == TRModuleStep)
    {
    	if(TRModuleStepCounter)
    		TRModuleStepCounter--;
    }
    else
    	TRModuleStepCounter = 5000;
    LastTRModuleStep = TRModuleStep;

    if(LastGTModuleStep == GTModuleStep)
    {
    	if(GTModuleStepCounter)
    		GTModuleStepCounter--;
    }
    else
    	GTModuleStepCounter = 5000;
    LastGTModuleStep = GTModuleStep;

