Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
    if(LastOFModuleStep == OFModuleStep)
    {
    	if(OFModuleStepCounter)
    		OFModuleStepCounter--;
    }
    else
    	OFModuleStepCounter = 5000;
    LastOFModuleStep = OFModuleStep;

    if(LastSPModuleStep == SPModuleStep)
    {
    	if(SPModuleStepCounter)
    		SPModuleStepCounter--;
    }
    else
    	SPModuleStepCounter = 5000;
    LastSPModuleStep = SPModuleStep;

    // STEP BY STEP MODE
	//StepbyStepMode SBSMode
	if(TRSbsMON)
	{
		if(TRModuleStep == 7)
			TRModuleStep = 0;
		else
			TRModuleStep++;

		TRSbsMode = TRUE;
		TRSbsMON = FALSE;
	}
	if(GTSbsMON)
	{
		if(GTModuleStep == 9)
			GTModuleStep = 0;
		else
			GTModuleStep++;

		GTSbsMode = TRUE;
		GTSbsMON = FALSE;
	}
	if(OFSbsMON)
	{
		if(OFModuleStep == 8)
			OFModuleStep = 0;
		else
			OFModuleStep++;

		OFSbsMode = TRUE;
		OFSbsMON = FALSE;
	}
	if(SPSbsMON)
	{
		if(SPModuleStep == 7)
			SPModuleStep = 0;
		else
			SPModuleStep++;

		SPSbsMode = TRUE;
		SPSbsMON = FALSE;
	}

	// Modular Mode
	if(TRModMON)
	{
		if(TRModuleStep == 7)
			TRModuleStep = 0;
		else
			TRModuleStep++;

		TRModMode = TRUE;
		TRModMON = FALSE;
	}
	if(GTModMON)
	{
		if(GTModuleStep == 9)
			GTModuleStep = 0;
		else
			GTModuleStep++;

		GTModMode = TRUE;
		GTModMON = FALSE;
	}
	if(OFModMON)
	{
		if(OFModuleStep == 8)
			OFModuleStep = 0;
		else
			OFModuleStep++;

		OFModMode = TRUE;
		OFModMON = FALSE;
	}
	if(SPModMON)
	{
		if(SPModuleStep == 7)
			SPModuleStep = 0;
		else
			SPModuleStep++;

		SPModMode = TRUE;
		SPModMON = FALSE;
	}

    /* Coiling to PORT */
    if(!MachineRunning && ServiceMode)
    {	// IT Module is controlled by SLAVE
    	ITMotorTrayElevator = ITMotorTrayElevatorMON;
    	ITMotorTrayElevatorDir = ITMotorTrayElevatorDirMON;
    	if(!ITTrayElevationMinSensor)
    		ITValveTrayPos = ITValveTrayPosMON;

    	if(TRExtenderPneuValveMON)
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, PORT_TR_EXTPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, 0);
    	if(TRReorientPneuValveMON)
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, PORT_TR_REOPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, 0);
    	if(TRVacuumValveMON)
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, PORT_TR_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, 0);
    	if(TRFoilPusherValveMON)
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, PORT_GT_INFPUSHPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, 0);

    	// GT Module is controlled by SLAVE
    	GTInFillGripPneuValve = GTInFillGripPneuValveMON;
    	GTOutFillOpenPneuValve = GTOutFillOpenPneuValveMON;
    	GTOutFillGripPneuValve = GTOutFillGripPneuValveMON;
    	GTTransferPneuValve = GTTransferPneuValveMON;

    	if(OFGatePneuValveMON)
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, PORT_OF_GATEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, 0);
    	if(OFEngagePneuValveMON)
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, PORT_OF_ENGAGEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, 0);
    	if(OFOpenPneuValveMON)
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, PORT_OF_OPENPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, 0);
    	if(OFVacuumValveMON)
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, PORT_OF_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, 0);

    	// Vibrator Filling Module is controlled by SLAVE
    	VFVibEngagePneuValve = VFVibEngagePneuValveMON;
    	VFVibrator = VFVibratorMON;

    	if(SPSealerPneuValveMON)
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, PORT_SP_SEALERPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, 0);

    	// Vibrator Sealer Module is controller by SLAVE
    	SPVibEngagePneuValve = SPVibEngagePneuValveMON;
    	SPPusherValve = SPPusherValveMON;
    	SPVibrator = SPVibratorMON;

    	if(WLLrGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, PORT_W_LLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, 0);
		if(WLSmGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, PORT_W_LSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, 0);
		if(WLOpGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, PORT_W_LOPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, 0);

		if(WRLrGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, PORT_W_RLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, 0);
		if(WRSmGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, PORT_W_RSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, 0);
		if(WROpGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, PORT_W_ROPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, 0);
    }
    if(LastServiceMode != ServiceMode)		// if servicemode just turned off, back to standby position
    {
    	if(!ServiceMode)
    	{
    		// IT Module
    		ITMotorTrayElevator = FALSE;
			//ITMotorTrayElevatorDir = ITMotorTrayElevatorDirMON;
			//ITValveTrayPos = ITValveTrayPosMON;

    		// TR Module
			ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, 0);

			ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, 0);

