Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
			// GT Module
			GTInFillGripPneuValve = TRUE;	// Grip Open
			GTTransferPneuValve = FALSE;
			GTOutFillOpenPneuValve = FALSE;
			GTOutFillGripPneuValve = TRUE;	// Grip Open

			// OF Module
			ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PIN_OF_VACUUM_SENSOR_BASE, PIN_OF_VACUUM_SENSOR_PIN, 0);
	    	VFVibEngagePneuValve = FALSE;
	    	VFVibrator = FALSE;

	    	// SP Module
			ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, 0);
			SPVibEngagePneuValve = FALSE;
			SPPusherValve = FALSE;
			SPVibrator = FALSE;

			// W Module
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, 0);

			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, 0);
    	}
    }
    LastServiceMode = ServiceMode;

    /* Outputs that need to be controlled indepently
    if(!MachineRunning)
    {
    	if(PRRollerValveON)
    		ROM_GPIOPinWrite(PORT_PULLROLL_VALVE_BASE, PORT_PULLROLL_VALVE_PIN, PORT_PULLROLL_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_PULLROLL_VALVE_BASE, PORT_PULLROLL_VALVE_PIN, 0);
    }
	  Outputs that need to be controlled indepently */

    // When Machine Running
    if(!ServiceMode)
    {
    	// Skip ALL SLAVES I/O
    	if(TRExtenderPneuValve)
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, PORT_TR_EXTPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, 0);
    	if(TRReorientPneuValve)
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, PORT_TR_REOPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, 0);
    	if(TRVacuumValve)
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, PORT_TR_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, 0);
    	if(GTFPushPneuValve)
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, PORT_GT_INFPUSHPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, 0);

    	// Filling
    	if(OFGatePneuValve)
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, PORT_OF_GATEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, 0);
    	if(OFEngagePneuValve)
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, PORT_OF_ENGAGEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, 0);
    	if(OFOpenPneuValve)
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, PORT_OF_OPENPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, 0);
    	if(OFVacuumValve)
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, PORT_OF_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, 0);

    	// Sealing
    	if(SPSealerPneuValve)
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, PORT_SP_SEALERPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, 0);

    	//Weigher
    	if(WRLrGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, PORT_W_RLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, 0);
		if(WRSmGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, PORT_W_RSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, 0);
		if(WROpGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, PORT_W_ROPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, 0);

		if(WLLrGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, PORT_W_LLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, 0);
		if(WLSmGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, PORT_W_LSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, 0);
		if(WLOpGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, PORT_W_LOPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, 0);

    }
    /* Coiling to PORT */

    /* Coiling to PIN */
	//	INPUT WITH BUFFER
    // Infeed Table **IN SLAVE**

    // Buttons
    if(LastRunBtn != !ROM_GPIOPinRead(PIN_BTN_RUN_BASE, PIN_BTN_RUN_PIN))
    	RunBtn = !ROM_GPIOPinRead(PIN_BTN_RUN_BASE, PIN_BTN_RUN_PIN);
    LastRunBtn = !ROM_GPIOPinRead(PIN_BTN_RUN_BASE, PIN_BTN_RUN_PIN);

    if(LastStopBtn != !ROM_GPIOPinRead(PIN_BTN_STOP_BASE, PIN_BTN_STOP_PIN))
    	StopBtn = !ROM_GPIOPinRead(PIN_BTN_STOP_BASE, PIN_BTN_STOP_PIN);
    LastStopBtn = !ROM_GPIOPinRead(PIN_BTN_STOP_BASE, PIN_BTN_STOP_PIN);
    // Infeed Table
	if(ROM_GPIOPinRead(PIN_IT_RMATEMPTY_SENS_BASE, PIN_IT_RMATEMPTY_SENS_PIN))
	{
		if(ITRightMaterialAvailableSensor)
			ITRightMaterialAvailableSensor--;
		ITRightMaterialNotAvailableSensor = 100;
	}
	else
	{
		if(ITRightMaterialNotAvailableSensor)
			ITRightMaterialNotAvailableSensor--;
		ITRightMaterialAvailableSensor = FASTBUFFER;
	}
	// Transfer & Reorient
	if(!ROM_GPIOPinRead(PIN_TR_EXTPNEU_EXTSENS_BASE, PIN_TR_EXTPNEU_EXTSENS_PIN))
	{
		if(TRExtenderPneuExtSensor)
			TRExtenderPneuExtSensor--;
	}
	else
		TRExtenderPneuExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_TR_EXTPNEU_RETSENS_BASE, PIN_TR_EXTPNEU_RETSENS_PIN))
	{
		if(TRExtenderPneuRetSensor)
			TRExtenderPneuRetSensor--;
	}
	else
		TRExtenderPneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_TR_REOPNEU_EXTSENS_BASE, PIN_TR_REOPNEU_EXTSENS_PIN))
	{
		if(TRReorientPneuExtSensor)
			TRReorientPneuExtSensor--;
	}
	else
		TRReorientPneuExtSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_TR_REOPNEU_RETSENS_BASE, PIN_TR_REOPNEU_RETSENS_PIN))
	{
		if(TRReorientPneuRetSensor)
			TRReorientPneuRetSensor--;
	}
	else
		TRReorientPneuRetSensor = BufferSensor;
	if(ROM_GPIOPinRead(PIN_TR_VACUUM_SENS_BASE, PIN_TR_VACUUM_SENS_PIN))	// Active high
	{
		if(TRVacuumSensor)
			TRVacuumSensor--;
	}
	else
		TRVacuumSensor = BufferSensor;

	// Grip & Transfer ** IN SLAVE

	// Filling , Vibrator Filling IN SLAVE
	if(!ROM_GPIOPinRead(PIN_OF_GATEPNEU_EXTSENS_BASE, PIN_OF_GATEPNEU_EXTSENS_PIN))
	{
		if(OFGatePneuExtSensor)
			OFGatePneuExtSensor--;
	}
	else
		OFGatePneuExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_OF_GATEPNEU_RETSENS_BASE, PIN_OF_GATEPNEU_RETSENS_PIN))
	{
		if(OFGatePneuRetSensor)
			OFGatePneuRetSensor--;
	}
	else
		OFGatePneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ENGAGEPNEU_EXTSENS_BASE, PIN_OF_ENGAGEPNEU_EXTSENS_PIN))
	{
		if(OFEngagePneuExtSensor)
			OFEngagePneuExtSensor--;
	}
	else
		OFEngagePneuExtSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ENGAGEPNEU_RETSENS_BASE, PIN_OF_ENGAGEPNEU_RETSENS_PIN))
	{
		if(OFEngagePneuRetSensor)
			OFEngagePneuRetSensor--;
	}
	else
		OFEngagePneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_LOPENPNEU_EXTSENS_BASE, PIN_OF_LOPENPNEU_EXTSENS_PIN))
	{
		if(OFOpenPneuLExtSensor)
			OFOpenPneuLExtSensor--;
	}
	else
		OFOpenPneuLExtSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ROPENPNEU_EXTSENS_BASE, PIN_OF_ROPENPNEU_EXTSENS_PIN))
	{
		if(OFOpenPneuRExtSensor)
			OFOpenPneuRExtSensor--;
	}
	else
		OFOpenPneuRExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_OF_LOPENPNEU_RETSENS_BASE, PIN_OF_LOPENPNEU_RETSENS_PIN))
	{
		if(OFOpenPneuLRetSensor)
			OFOpenPneuLRetSensor--;
	}
	else
		OFOpenPneuLRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ROPENPNEU_RETSENS_BASE, PIN_OF_ROPENPNEU_RETSENS_PIN))
	{
		if(OFOpenPneuRRetSensor)
			OFOpenPneuRRetSensor--;
	}
	else
		OFOpenPneuRRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_VACUUM_SENSOR_BASE, PIN_OF_VACUUM_SENSOR_PIN))
	{
		if(OFVacuumSensor)
			OFVacuumSensor--;
	}
	else
		OFVacuumSensor = BufferSensor;

	// Sealing, Vibrator Sealer IN SLAVE
	if(!ROM_GPIOPinRead(PIN_SP_SEALERPNEU_EXTSENS_BASE, PIN_SP_SEALERPNEU_EXTSENS_PIN))
	{
		if(SPSealerPneuExtSensor)
			SPSealerPneuExtSensor--;
	}
	else
		SPSealerPneuExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_SP_SEALERPNEU_RETSENS_BASE, PIN_SP_SEALERPNEU_RETSENS_PIN))
	{
		if(SPSealerPneuRetSensor)
			SPSealerPneuRetSensor--;
	}
	else
		SPSealerPneuRetSensor = BufferSensor;

	// Weigher
	if(!ROM_GPIOPinRead(PIN_W_LHOPPER_SENS_BASE, PIN_W_LHOPPER_SENS_PIN))
	{
		if(LHopperSensor)
			LHopperSensor--;
	}
	else
		LHopperSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_W_RHOPPER_SENS_BASE, PIN_W_RHOPPER_SENS_PIN))
	{
		if(RHopperSensor)
			RHopperSensor--;
	}
	else
		RHopperSensor = BufferSensor;

    /* Coiling to PIN */
    if(BlinkFlag)
    {
        if(blinkON)
            blinkON--;
        else
        {
            blinkOFF = 700;
            BlinkFlag = FALSE;
        }

