Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
    }
    else
    {
        if(blinkOFF)
            blinkOFF--;
        else
        {
            blinkON = 700;
            BlinkFlag = TRUE;
        }
    }

	/* Infeed Table Module v */
    // IT = Infeed Table
    if(ITEnable && (!SPIComErrorFlag))
    {
    	if(!ITSwitchTrayStep)
    	{
    		// Check if there are any foil at all at any of the tray
    		if( (!ITLeftMaterialNotAvailableSensor) && (!ITRightMaterialNotAvailableSensor) )
    		{
    			ITReady = FALSE;
    			ITMotorTrayElevator = FALSE;
    		}
    		// Check if there are any foil at all at any of the tray
    		else if( (ITTrayPosLeftSensor) && (ITTrayPosRightSensor) )
    		{
    			ITReady = FALSE;
    			ITMotorTrayElevator = FALSE;
    		}
    		else
    		{
    			// Checkposition of the active tray, Left or Right
				if(!ITTrayPosLeftSensor)
				{
					// Check if the foil is available and on the correct place
					if( (!ITLeftMaterialAvailableSensor) && (!ITTrayElevationMaxSensor) )
					{
						// if material is sensed
						ITReady = TRUE;
						ITMotorTrayElevator = FALSE;
					}
					else
					{
						ITReady = FALSE;
						if(!ITLeftMaterialNotAvailableSensor)	// if foil is empty, Switch Tray
							ITSwitchTrayStep = 1;
						else
						{
							if(ITTrayElevationMaxSensor)// if foil is available but not at the position
							{
								ITMotorTrayElevatorDir = DirUP;
								ITMotorTrayElevator = TRUE;
							}
						}
					}
				}
				else if(!ITTrayPosRightSensor)
				{
					// Check if the foil is available and on the correct place
					if( (!ITRightMaterialAvailableSensor) && (!ITTrayElevationMaxSensor) )
					{
						// if material is sensed
						ITReady = TRUE;
						ITMotorTrayElevator = FALSE;
					}
					else
					{
						ITReady = FALSE;
						if(!ITRightMaterialNotAvailableSensor)	// if foil is empty, Switch Tray
							ITSwitchTrayStep = 1;
						else
						{
							if(ITTrayElevationMaxSensor)// if foil is available but not at the position
							{
								ITMotorTrayElevatorDir = DirUP;
								ITMotorTrayElevator = TRUE;
							}
						}
					}
				}
    		}
    	}
    	else
    	{
    		switch(ITSwitchTrayStep)
    		{
    			case 1:
    				ITMotorTrayElevatorDir = DirDOWN;
    				ITMotorTrayElevator = TRUE;
    				if(!ITTrayElevationMinSensor)
    				{
    					ITSwitchTrayStep = 2;
    				}
    				break;
    			case 2:
    				ITMotorTrayElevator = FALSE;
    				if(!ITTrayPosLeftSensor)
    				{
    					if(!ITTrayElevationMinSensor)
    						ITValveTrayPos = FALSE;
    					ITSwitchTrayStep = 3;
    				}
    				else if(!ITTrayPosRightSensor)
    				{
    					if(!ITTrayElevationMinSensor)
    						ITValveTrayPos = TRUE;
    					ITSwitchTrayStep = 3;
    				}
    				break;
    			case 3:
    				if(!ITValveTrayPos)
    					if(!ITTrayPosRightSensor)
    						ITSwitchTrayStep = 0;
    				if(ITValveTrayPos)
    					if(!ITTrayPosLeftSensor)
    						ITSwitchTrayStep = 0;
    				break;
    		}
    	}
    }
    // Turn Off motor when ITEnable OFF
    if( (!ITEnable) && (!ServiceMode) )
    	ITMotorTrayElevator = FALSE;

	/* Transfer & Reorient Module v */
    if(MachineRunning || TRSbsMode || TRModMode || TRInitting)
    {
		switch(TRModuleStep)
		{
			case 0:  // Standby
				TRExtenderPneuValve = FALSE;
				TRReorientPneuValve = FALSE;
				TRVacuumValve		= FALSE;
				//TRFoilPusherValve	= TRUE;

				if( (MachineRunning) && (!MachineStopping) || TRInitting )
				{
					if( (!TRExtenderPneuRetSensor) && (!TRReorientPneuRetSensor)
							&& (TRExtenderPneuExtSensor) && (TRReorientPneuExtSensor) )		// V1.3
					{
						if(!TRSbsMode)
							TRModuleStep = 1;
						else
							TRSbsMode = FALSE;

						if(TRInittingTOCounter)
						{
							TRInittingTOCounter = 0;
							//TRInitError -= 1;
						}
					}
					else
					{
						if(TRInitting)
						{
							if(!TRInittingTOCounter)
							{
								TRInittingTOCounter = InittingTO;
								//TRInitError += 1;
							}
						}
					}
				}
				break;
			case 1:	// Extend the Extender Pneu , about to get foil
				if(MachineStopping)
					TRModuleStep = 0;
				else
				{
					if( ((!TRModuleWaitingPick) && (ITReady || ITOverride)) || TRInitting)
					{
						TRExtenderPneuValve = TRUE;		// get vacuum to touch foil
						TRReorientPneuValve = FALSE;
						TRVacuumValve		= FALSE;
						//TRFoilPusherValve	= TRUE;
						if( (!TRExtenderPneuExtSensor)
								&& TRExtenderPneuRetSensor)
						{
							if(!TRSbsMode)
								TRModuleStep = 2;
							else
								TRSbsMode = FALSE;

							if(TRInittingTOCounter)
							{
								TRInittingTOCounter = 0;
								//TRInitError -= 2;
							}
						}
						else
						{
							if(TRInitting)
							{
								if(!TRInittingTOCounter)
								{
									TRInittingTOCounter = InittingTO;
									//TRInitError += 2;
								}
							}
						}
					}
				}
				break;
			case 2:	// Vacuum ON and TRFoilPusher retracts, vacuum the foil
				TRExtenderPneuValve = TRUE;
				TRReorientPneuValve = FALSE;
				if(!TRInitting)
					TRVacuumValve		= TRUE;
				//TRFoilPusherValve	= FALSE;
				if(!TRVacuumValveDelayCounter)
				{
					if(!TRInitting)
						TRVacuumValveDelayCounter = TRVacuumValveDelay + 1;

					if(!TRSbsMode)
						TRModuleStep = 3;
					else
						TRSbsMode = FALSE;
				}
				break;
			case 3: // Retract the extender, raise the foil
				if(!TRVacuumValveDelayCounter)
				{
					TRExtenderPneuValve = FALSE;
					TRReorientPneuValve = FALSE;
					if(!TRInitting)
						TRVacuumValve		= TRUE;
					//TRFoilPusherValve	= FALSE;
					if(!TRExtenderPneuRetSensor)
					{
						// Check if vacuumed correctly
						if((!TRVacuumSensor) || IgnoreTRVacuumSensor || TRInitting || MachineStopping)
						{
							TRVacuumSensorErrorCounter = 0;
							if(!TRSbsMode)
								TRModuleStep = 4;
							else
								TRSbsMode = FALSE;
						}
						else	// if vacuum not correctly, repeat from TRModuleStep 0
						{
							TRModuleStep = 0;
							TRVacuumSensorErrorCounter += 1;
						}
						if(TRInittingTOCounter)
						{
							TRInittingTOCounter = 0;
							//TRInitError -= 4;
						}
					}
					else
					{
						if(TRInitting)
						{
							if(!TRInittingTOCounter)
							{
								TRInittingTOCounter = InittingTO;
								//TRInitError += 4;
							}
						}
					}
				}
				break;
			case 4: // Transfer & Reorient, go to in-fill gripper
				TRExtenderPneuValve = FALSE;
				TRReorientPneuValve = TRUE;
				TRVacuumValve		= TRUE;
				//TRFoilPusherValve	= FALSE;
				if( (!TRReorientPneuExtSensor)
					&& TRReorientPneuRetSensor)
				{
					if(!TRSbsMode)
						TRModuleStep = 5;
					else
						TRSbsMode = FALSE;

					TRModuleWaiting = TRUE;

					if(TRInittingTOCounter)
					{
						TRInittingTOCounter = 0;
						//TRInitError -= 8;
					}
				}
				else
				{
					if(TRInitting)
					{
						if(!TRInittingTOCounter)
						{
							TRInittingTOCounter = InittingTO;
							//TRInitError += 8;
						}
					}
				}
				break;
			case 5: //	Waiting for in-fill gripper to take over foil
				if( (!TRModuleWaiting) || MachineStopping || TRInitting)
				{
					TRModuleStep = 6;
					TRModuleWaitingPick = TRUE;
				}
				break;
			case 6:	// Shut down vacuum before moving
				TRExtenderPneuValve = FALSE;
				TRReorientPneuValve = TRUE;
				TRVacuumValve		= FALSE;
				//TRFoilPusherValve	= FALSE;
				if( (!TRVacuumValveDelayCounter) && (!TRInitting) )
					TRVacuumValveDelayCounter = TRVacuumValveDelay + 1;

				if(!TRSbsMode)
					TRModuleStep = 7;
				else
					TRSbsMode = FALSE;

				break;
			case 7: // After delay
				if(!TRVacuumValveDelayCounter)
				{
					TRModuleStep = 0;
					// Step 0
					TRExtenderPneuValve = FALSE;
					TRReorientPneuValve = FALSE;
					TRVacuumValve		= FALSE;
					TRModMode = FALSE;
					TRInitting = FALSE;
				}
				break;
		}
    }

	if(TRVacuumValveDelayCounter)
		TRVacuumValveDelayCounter--;
	if(TRInittingTOCounter)
	{
		TRInittingTOCounter--;
		if(!TRInittingTOCounter)
		{
			// TR Init Error Identifier Subroutine
			switch(TRModuleStep)
			{
				case 0:
					if(TRExtenderPneuRetSensor)
						TRInitError |= 1;
					if(TRReorientPneuRetSensor)
						TRInitError |= 2;
					if(!TRExtenderPneuExtSensor)
						TRInitError |= 1;
					if(!TRReorientPneuExtSensor)
						TRInitError |= 2;
					break;
				case 1:
					if(TRExtenderPneuExtSensor)
						TRInitError |= 4;
					if(!TRExtenderPneuRetSensor)
						TRInitError |= 4;
					break;
				case 4:
					if(TRReorientPneuExtSensor)
						TRInitError |= 8;
					if(!TRReorientPneuRetSensor)
						TRInitError |= 8;
			}
			TRModuleStep++;
		}
	}
	/* Transfer & Reorient Module ^ */

	/* Grip & Transfer Module v */
	if(MachineRunning || GTSbsMode || GTModMode || GTInitting)
	{
		switch(GTModuleStep)
		{
			case 0:  // Standby
				GTFPushPneuValve = FALSE;
				GTInFillGripPneuValve = TRUE;	// Grip Open
				GTTransferPneuValve = FALSE;

				GTOutFillOpenPneuValve = FALSE;
				GTOutFillGripPneuValve = TRUE;	// Grip Open

				if( (MachineRunning && (!MachineStopping)) || GTInitting )
				{	// no Open Gripper Delay.. maybe need later after trial
					if( (!GTOutFillOpenPneuLRetSensor) && (!GTOutFillOpenPneuRRetSensor) && (!GTTransferPneuRetSensor) )
					{
						if(!GTSbsMode)
							GTModuleStep = 1;
						else
							GTSbsMode = FALSE;

						if(GTInittingTOCounter)
						{
							GTInittingTOCounter = 0;
							//GTInitError -= 1;
						}
					}
					else
					{
						if(GTInitting)
						{
							if(!GTInittingTOCounter)
							{
								GTInittingTOCounter = InittingTO;
								//GTInitError += 1;
							}
						}
					}
				}
				break;
			case 1:  // SA1 : Receive the foil from TR (Activate foil pusher), SA2 Initiate Filling Process
				// SA 1 Close grip because the foil is already in position by TR Module
				GTTransferPneuValve = FALSE;
				if( TRModuleWaiting && (!GTInitting) )
				{
					GTFPushPneuValve = TRUE;
					GTFPushPneuValveDurationCounter = GTFPushPneuValveDuration;
				}
				// SA 2 Close grip because the foil is already in position by F Module
				if(OFModuleWaiting || GTFirstCycle || GTInitting)
				{
					GTOutFillOpenPneuValve = FALSE;
					GTOutFillGripPneuValve = FALSE;	// Grip Closed
				}

				if(((!GTOutFillGripPneuLRetSensor) && (!GTOutFillGripPneuRRetSensor) && (GTFPushPneuValve || GTInitting)) || MachineStopping)
				{
					if(MachineStopping)
					{
						GTFPushPneuValve = FALSE;
						GTFPushPneuValveDurationCounter = 0;
					}
					if(!GTSbsMode)
						GTModuleStep = 2;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						//GTInitError -= 2;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							//GTInitError += 2;
						}
					}
				}
				break;

			case 2:	// SA 1 After PushPneuDelay, Activate Gripper
				//SA 2  Open the bag

				GTTransferPneuValve = FALSE;

				// SA 1 After PushPneuDelay, Activate Gripper
				if(!GTFPushPneuValveDurationCounter)
				GTInFillGripPneuValve = FALSE;	// Grip Closed

				if((!GTInFillGripPneuLRetSensor) && (!GTInFillGripPneuRRetSensor))
				{
					GTFPushPneuValve = FALSE;
					// Move TR Module Waiting after Transfer Pneu been done
					if(TRModuleWaiting)
					{
						TRVacuumValve	= FALSE;
						TRModuleWaiting = FALSE;
						TRModuleWaitingPick = TRUE;			// TR will wait until TransferPneu move before starting again
					}
				}

				// SA 2 Initiating opening the bag
				GTOutFillOpenPneuValve = TRUE;	// Open the bag
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if((!GTOutFillOpenPneuLExtSensor) && (!GTOutFillOpenPneuRExtSensor) && (!GTFPushPneuValve))
				{
					OFModuleWaiting = FALSE;
					if(!GTSbsMode)
						GTModuleStep = 3;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						//GTInitError -= 4;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							//GTInitError += 4;
						}
					}
				}
				break;
			case 3:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

				// SA 2 // Open the bag
				GTOutFillOpenPneuValve = TRUE;	// Open the bag
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if((!GTOutFillOpenPneuLExtSensor) && (!GTOutFillOpenPneuRExtSensor))
				{
					if(!GTSbsMode)
						GTModuleStep = 4;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						//GTInitError -= 8;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							//GTInitError += 8;
						}
					}
				}
				break;
			case 4:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

