Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
				// SA 2 // Request Filling and wait till Filling finished
				// Skip Filling if First Cycle
				if(!GTFirstCycle)
					GTRequestFilling = TRUE;

				if(!GTSbsMode)
					GTModuleStep = 5;
				else
					GTSbsMode = FALSE;
				break;
			case 5:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

				// SA2 Close the bag after filling
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if( (!GTRequestFilling) || GTInitting )
				{
					//GTOutFillOpenPneuValve = FALSE;	// Close the bag after filling.. need delay
					if(!GTCloseBagDelayCounter)
						GTCloseBagDelayCounter = GTCloseBagDelay + 1;
				}
				if((!GTOutFillOpenPneuLRetSensor) && (!GTOutFillOpenPneuRRetSensor))
				{
					if(!GTSbsMode)
						GTModuleStep = 6;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						//GTInitError -= 16;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							//GTInitError += 16;
						}
					}
				}
				break;
			case 6:	// SA1 & SA2 change position.. TransferPneu Activated
				GTInFillGripPneuValve = FALSE;	// Grip Closed
				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = FALSE;	// Grip Closed
				GTTransferPneuValve = TRUE;		// Shift Arm 1 go to filling position
				if(!GTTransferPneuExtSensor)
				{
					GTSA1ModuleWaiting = TRUE;
					GTSA2ModuleWaiting = TRUE;
					// Moved from GTModule = 2 v
					if(TRModuleWaitingPick)
					{
						TRModuleWaitingPick = FALSE;
					}
					// Moved from GTModule = 2 ^
					if(!GTSbsMode)
						GTModuleStep = 7;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						//GTInitError -= 32;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							//GTInitError += 32;
						}
					}
				}
				break;
			case 7:
				// SA1 : Wait til FModule grab the foil with vacuum

				GTInFillGripPneuValve = FALSE;	// Grip still  Closed

				// SA2 : Wait till SModule Seal the bag..

				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = FALSE;	// Grip still  Closed

				if( ((!GTSA1ModuleWaiting) && (!GTSA2ModuleWaiting)) || MachineStopping || GTInitting )
				{
					if(!GTSbsMode)
						GTModuleStep = 8;
					else
						GTSbsMode = FALSE;
				}
				break;
			case 8:
				// SA1 : Open the gripper
				GTInFillGripPneuValve = TRUE;	// Grip Open

				// SA2 : Open the gripper
				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = TRUE;	// Grip Open

				GTBothOpenGripDelayCounter = GTBothOpenGripDelay + 1;

				if(!GTSbsMode)
					GTModuleStep = 9;
				else
					GTSbsMode = FALSE;
				break;
			case 9:
				if((!GTSbsMode) || GTModMode)
					GTFirstCycle = FALSE;
				if(!GTBothOpenGripDelayCounter)
				{
					GTModuleStep = 0;
					// Step 0
					GTFPushPneuValve = FALSE;
					GTInFillGripPneuValve = TRUE;	// Grip Open
					GTTransferPneuValve = FALSE;

					GTOutFillOpenPneuValve = FALSE;
					GTOutFillGripPneuValve = TRUE;	// Grip Open

					GTModMode = FALSE;
					GTInitting = FALSE;
				}
				break;
		}
	}

	if(GTFPushPneuValveDurationCounter)
		GTFPushPneuValveDurationCounter--;

	if(GTCloseBagDelayCounter)
	{
		GTCloseBagDelayCounter--;
		if(!GTCloseBagDelayCounter)
			GTOutFillOpenPneuValve = FALSE;  // Close Bag
	}

	if(GTBothOpenGripDelayCounter)
		GTBothOpenGripDelayCounter--;

	if(GTInittingTOCounter)
	{
		GTInittingTOCounter--;
		if(!GTInittingTOCounter)
		{
			// GT Init Error Identifier Subroutine
			switch(GTModuleStep)
			{
				case 0:
					if(GTOutFillOpenPneuLRetSensor)
						GTInitError += 1;
					if(GTOutFillOpenPneuRRetSensor)
						GTInitError += 2;
					if(GTTransferPneuRetSensor)
						GTInitError += 4;
					break;
				case 1:
					if(GTOutFillGripPneuLRetSensor)
						GTInitError += 8;
					if(GTOutFillGripPneuRRetSensor)
						GTInitError += 16;
					break;
				case 2:
					if(GTInFillGripPneuLRetSensor)
						GTInitError += 32;
					if(GTInFillGripPneuRRetSensor)
						GTInitError += 64;
					if(GTOutFillOpenPneuLExtSensor)
						GTInitError += 128;
					if(GTOutFillOpenPneuRExtSensor)
						GTInitError += 256;
					break;
				case 6:
					if(GTTransferPneuExtSensor)
						GTInitError += 512;
					break;
			}
			GTModuleStep++;
		}
	}
	/* Grip & Transfer Module ^ */

	/* Filling Module v */
	if(MachineRunning || OFSbsMode || OFModMode || OFInitting)
	{
		switch(OFModuleStep)
		{
			case 0: // Standby
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;
				OFOpenPneuValve = FALSE;
				OFVacuumValve = FALSE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;

				if((MachineRunning && (!MachineStopping)) || OFInitting )
				{
					if( (!OFGatePneuRetSensor) && (!OFEngagePneuRetSensor) && (!OFOpenPneuRRetSensor) && (!OFOpenPneuLRetSensor) && (!VFVibEngagePneuRetSensor) )
					{
						if(!OFSbsMode)
							OFModuleStep = 1;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							//OFInitError -= 1;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								//OFInitError += 1;
							}
						}
					}
				}
				break;
			case 1: // Receiving from GTModule, Extend the engage and open pneu to locate vacuum into position
				if(GTSA1ModuleWaiting || MachineStopping || OFInitting)
				{
					OFGatePneuValve	= FALSE;
					OFEngagePneuValve = TRUE;
					OFOpenPneuValve = TRUE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = FALSE;
					VFVibrator = FALSE;
					if((!OFEngagePneuExtSensor) && (!OFOpenPneuRExtSensor) && (!OFOpenPneuLExtSensor))
					{
						if(!OFSbsMode)
							OFModuleStep = 2;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							//OFInitError -= 2;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								//OFInitError += 2;
							}
						}
					}
				}
				break;
			case 2:	// Activate Vacuum
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = TRUE;
				OFOpenPneuValve = TRUE;
				OFVacuumValve = TRUE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				if(!OFVacuumValveDelayCounter)
				{
					OFVacuumValveDelayCounter = OFVacuumValveDelay + 1;
					if(!OFSbsMode)
						OFModuleStep = 3;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 3:	// Vacuum is sure in effect now
				if(!OFVacuumValveDelayCounter)
				{
					GTSA1ModuleWaiting = FALSE;
					OFModuleWaiting = TRUE;

					if(!OFSbsMode)
						OFModuleStep = 4;
					else
					OFSbsMode = FALSE;
					// GTSA2 GRIP HERE
				}
				break;
			case 4:	// Open the bag (Step 1)& Ready the vibrator
				if((!OFModuleWaiting) || MachineStopping || OFInitting)
				{
					OFGatePneuValve	= FALSE;
					OFEngagePneuValve = TRUE;
					OFOpenPneuValve = FALSE;		// Open the bag
					OFVacuumValve = TRUE;
					if(!OFInitting)
						VFVibEngagePneuValve = FALSE;	// Delayed : Engage the Vibrator
					else
						VFVibEngagePneuValve = TRUE;	// Used for Initting purpose
					VFVibrator = FALSE;
					if( (!OFOpenPneuRRetSensor) && (!OFOpenPneuLRetSensor))
					{
						if(!OFSbsMode)
							OFModuleStep = 5;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							//OFInitError -= 4;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								//OFInitError += 4;
							}
						}
					}
				}
				break;
			case 5:	// Open the bag (Step 2)& Ready the vibrator
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;		// Open the bag further
				OFOpenPneuValve = FALSE;
				if(!OFInitting)
					VFVibEngagePneuValve = FALSE;	// Delayed : Engage the Vibrator
				else
					VFVibEngagePneuValve = TRUE;	// Used for Initting purpose
				VFVibrator = FALSE;
				// If not Initting, just OFEngagePneuRetSensor, if Initting, check both OFEngage & VfVib
				if( (!OFEngagePneuRetSensor) && ((!OFInitting) || (!VFVibEngagePneuExtSensor)) )
				{
					OFVacuumValve = FALSE;
					if(!OFSbsMode)
						OFModuleStep = 6;
					else
						OFSbsMode = FALSE;

					if(OFInittingTOCounter)
					{
						OFInittingTOCounter = 0;
						//OFInitError -= 8;
					}
				}
				else
				{
					if(OFInitting)
					{
						if(!OFInittingTOCounter)
						{
							OFInittingTOCounter = InittingTO;
							//OFInitError += 8;
						}
					}
				}
				break;
			case 6:	// Open the BRIDGE to initiate FILLING PROCESS
				if(GTRequestFilling || MachineStopping || OFInitting)
				{
					OFGatePneuValve	= TRUE;			// Thrust the Gate Tongue
					OFEngagePneuValve = FALSE;
					OFOpenPneuValve = FALSE;
					OFVacuumValve = FALSE;
					if(!OFInitting)
						VFVibEngagePneuValve = FALSE;	// Delayed : Engage the Vibrator
					else
						VFVibEngagePneuValve = TRUE;	// Used for Initting purpose
					VFVibrator = FALSE;
					if(!OFGatePneuExtSensor)
					{
						if(!OFSbsMode)
							OFModuleStep = 7;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							//OFInitError -= 16;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								//OFInitError += 16;
							}
						}
					}
				}
				break;
			case 7:	// Start FILLING when weigher module READY
				if(MachineStopping || OFInitting)
				{
					OFModuleStep = 8;
					OFRequestFilling = FALSE;
				}
				if(WLCLWeightOK || WLCRWeightOK)
				{
					OFRequestFilling = TRUE;
					VFVibrator = TRUE;				// Start Vibrating
					VFVibratorEngageDelayCounter = VFVibratorEngageDelay + 1;
					//VFVibEngagePneuValveVibratorMode = TRUE;	// Start SUPER Vibrating
					if(!OFSbsMode)
						OFModuleStep = 8;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 8:	// Close the gate after finished & Stop Vibrating, tell GT to continue
				if( (!OFRequestFilling) && (!OFGatePneuValveDurationCounter) && (!WLOpGatePneuDurationCounter) && (!WROpGatePneuDurationCounter) )
				{
					GTRequestFilling = FALSE;			// Finished Filling, tell GT to continue

					OFGatePneuValve	= FALSE;			// Close the gate
					OFEngagePneuValve = FALSE;
					OFOpenPneuValve = FALSE;
					OFVacuumValve = FALSE;
					// OFF Vibrate Mode Moved to case 9
					//VFVibrator = FALSE;					// Stop Vibrating
					if( (!OFGatePneuRetSensor) )// && (!VFVibEngagePneuRetSensor) )
					{
						//OFGatePneuFilled = FALSE;
						if(!OFSbsMode)
							OFModuleStep = 9;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							//OFInitError -= 32;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								//OFInitError += 32;
							}
						}
					}
				}
				break;
			case 9:	// back to module step 0
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;
				OFOpenPneuValve = FALSE;
				OFVacuumValve = FALSE;
				VFVibratorEngageDelayCounter = 0;			// Cancel the order to vibrate if delay too long
				VFVibratorEngageVibDelayCounter = 0;		// Cancel the order to vibrate if delay too long
				VFVibEngagePneuValveVibratorMode = FALSE;	// Stop SUPER Vibrating
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				OFModMode = FALSE;
				OFInitting = FALSE;
				if(!VFVibEngagePneuRetSensor)
				{
					//OFGatePneuFilled = FALSE;
					if(!OFSbsMode)
						OFModuleStep = 0;
					else
						OFSbsMode = FALSE;

					if(OFInittingTOCounter)
					{
						OFInittingTOCounter = 0;
						//OFInitError -= 32;
					}
				}
				else
				{
					if(OFInitting)
					{
						if(!OFInittingTOCounter)
						{
							OFInittingTOCounter = InittingTO;
							//OFInitError += 32;
						}
					}
				}
				/*
				if(!OFSbsMode)
					OFModuleStep = 0;
				else
					OFSbsMode = FALSE;*/
				break;
		}
	}

	if(OFVacuumValveDelayCounter)
		OFVacuumValveDelayCounter--;

	if(OFInittingTOCounter)
	{
		OFInittingTOCounter--;
		if(!OFInittingTOCounter)
		{
			//OF Init Error Identifier Subroutine
			switch(OFModuleStep)
			{
				case 0:
					if(OFGatePneuRetSensor)
						OFInitError += 1;
					if(OFEngagePneuRetSensor)
						OFInitError += 2;
					if(OFOpenPneuRRetSensor)
						OFInitError += 4;
					if(OFOpenPneuLRetSensor)
						OFInitError += 8;
					if(VFVibEngagePneuRetSensor)
						OFInitError += 16;
					break;
				case 1:
					if(OFEngagePneuExtSensor)
						OFInitError += 32;
					if(OFOpenPneuRExtSensor)
						OFInitError += 64;
					if(OFOpenPneuLExtSensor)
						OFInitError += 128;
					break;
				case 5:
					if(VFVibEngagePneuExtSensor)
						OFInitError += 256;
					break;
				case 6:
					if(OFGatePneuExtSensor)
						OFInitError += 512;
					break;
			}
			OFModuleStep++;
		}
	}

	if(VFVibratorEngageDelayCounter)
	{
		VFVibratorEngageDelayCounter--;
		if(!VFVibratorEngageDelayCounter)
		{
			VFVibEngagePneuValve = TRUE;	// Engaging
			VFVibratorEngageVibDelayCounter = VFVibratorEngageVibDelay + 1;
		}
	}
	if(VFVibratorEngageVibDelayCounter)
	{
		VFVibratorEngageVibDelayCounter--;
		if(!VFVibratorEngageVibDelayCounter)
			VFVibEngagePneuValveVibratorMode = TRUE;	// Start SUPER Vibrating
	}
	if(VFVibEngagePneuValveVibratorMode)
	{
		if(VFVibEngageVibratorPeriodCounter)
		{
			VFVibEngageVibratorPeriodCounter--;
			if(!VFVibEngageVibratorPeriodCounter)
			{
				if(VFVibEngagePneuValve)
				{
					VFVibEngagePneuValve = FALSE;
					VFVibEngageVibratorPeriodCounter = (VFVibEngageVibratorPeriod * (100 - VFVibEngageVibratorDutyCycle)) / 100;
				}
				else
				{
					VFVibEngagePneuValve = TRUE;
					VFVibEngageVibratorPeriodCounter = (VFVibEngageVibratorPeriod * VFVibEngageVibratorDutyCycle) / 100;
				}
			}
		}
		else
			VFVibEngageVibratorPeriodCounter = (VFVibEngageVibratorPeriod * (100 - VFVibEngageVibratorDutyCycle)) / 100; // Low Duty Cycle = 100% - DutyCycle
	}
	else
		VFVibEngageVibratorPeriodCounter = (VFVibEngageVibratorPeriod * (100 - VFVibEngageVibratorDutyCycle)) / 100; // Low Duty Cycle = 100% - DutyCycle
	/* Filling Module ^ */

	/* Sealing Module v */
	if(MachineRunning || SPSbsMode || SPModMode || SPInitting)
	{
		switch(SPModuleStep)
		{
			case 0: // Standby
				//SPSealerPneuValve		= FALSE; 	// Sealer Opened
				SPVibEngagePneuValve	= FALSE;	// Vibrator Disengaged
				SPPusherValve			= FALSE;		// Pusher Extended
				SPVibrator				= FALSE;	// Vibrator OFF

				if( (MachineRunning && (!MachineStopping)) || SPInitting )
				{
					if( (!SPVibEngagePneuRetSensor) && (!SPSealerPneuRetSensor) && (!SPPusherPneuRetSensor))
					{
						if(!SPSbsMode)
							SPModuleStep = 1;
						else
							SPSbsMode = FALSE;

						if(SPInittingTOCounter)
						{
							SPInittingTOCounter = 0;
							//SPInitError -= 1;
						}
					}
					else
					{
						if(SPInitting)
						{
							if(!SPInittingTOCounter)
							{
								SPInittingTOCounter = InittingTO;
								//SPInitError += 1;
							}
						}
					}
				}
				break;
			case 1: // Bag from GT is in Place
				if(GTSA2ModuleWaiting || MachineStopping || SPInitting)
				{
					SPSealerPneuValveDelayCounter = SPSealerPneuValveDelay + 1;	// Sealer controlled by timing
					//SPSealerPneuValve		= TRUE; 	// Sealer Closed
					SPVibEngagePneuValve	= FALSE;
					SPPusherValve			= FALSE;	// Pusher Retracted so VibEngage can be ext
					SPVibrator				= FALSE;
					if(!SPPusherPneuRetSensor)
					{
						GTSA2ModuleWaiting 		= FALSE;			// Tell GT Module SA 2 to continue
						if(!SPSbsMode)
							SPModuleStep = 2;
						else
							SPSbsMode = FALSE;

						if(SPInittingTOCounter)
						{
							SPInittingTOCounter = 0;
							//SPInitError -= 2;
						}
					}
					else
					{
						if(SPInitting)
						{
							if(!SPInittingTOCounter)
							{
								SPInittingTOCounter = InittingTO;
								//SPInitError += 2;
							}
						}
					}
				}
				break;
			case 2:	// Engage the vibrator
				//SPSealerPneuValve		= TRUE; 	// Sealer still Closed
				SPVibEngagePneuValve	= TRUE;		// Start engaging
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;
				if(!SPVibEngagePneuExtSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 3;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						//SPInitError -= 4;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							//SPInitError += 4;
						}
					}
				}
				break;
			case 3: // Vibrate
				//SPSealerPneuValve		= TRUE; 	// Sealer still Closed
				SPVibEngagePneuValve	= TRUE;
				SPPusherValve			= FALSE;
				SPVibrator				= TRUE;		// Vibrator ON
				if(!SPSbsMode)
					SPModuleStep = 4;
				else
					SPSbsMode = FALSE;
				break;
			case 4: // Open Sealer & Turn Off Vibrator
				//SPSealerPneuValve		= FALSE; 	// Start Opening
				SPVibEngagePneuValve	= TRUE;
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPSealerPneuRetSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 5;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						//SPInitError -= 8;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							//SPInitError += 8;
						}
					}
				}
				break;
			case 5: // Bring the VibEngagePneu down with the bag
				//SPSealerPneuValve		= FALSE; 	// Sealer Opened
				SPVibEngagePneuValve	= FALSE;	// Start disengaging
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPVibEngagePneuRetSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 6;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						//SPInitError -= 16;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							//SPInitError += 16;
						}
					}
				}
				break;
			case 6: // Push the bag out to conveyor
				//SPSealerPneuValve		= FALSE;
				SPVibEngagePneuValve	= FALSE;	// Vib is disengaged
				SPPusherValve			= TRUE;		// Pusher start pushing
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPPusherPneuExtSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 7;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						//SPInitError -= 32;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							//SPInitError += 32;
						}
					}
				}
				break;
			case 7:  // back to standby position
				SPModuleStep = 0;
				// Step 0
				SPVibEngagePneuValve	= FALSE;	// Vibrator Disengaged
				SPPusherValve			= FALSE;		// Pusher Extended
				SPVibrator				= FALSE;	// Vibrator OFF
				SPModMode = FALSE;
				SPInitting = FALSE;
				break;
		}
	}

	if(SPSealerPneuValveDelayCounter)
	{
		SPSealerPneuValveDelayCounter--;
		if(!SPSealerPneuValveDelayCounter)
		{
			SPSealerPneuValveDurationCounter = SPSealerPneuValveDuration;
		}
	}
	if(SPSealerPneuValveDurationCounter)
	{
		SPSealerPneuValveDurationCounter--;
		SPSealerPneuValve = TRUE;
		if(!SPSealerPneuValveDurationCounter)
		{

