Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
	HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY_DD;
	HWREG(GPIO_PORTF_BASE + GPIO_O_CR) = 0x20;

    // Initialize the GPIO
    ROM_GPIOPinTypeGPIOInput (GPIO_PORTA_BASE, 0x11);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTA_BASE, 0xEE);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTB_BASE, 0xFB);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, 0x04);

    ROM_GPIOPinTypeGPIOOutput (GPIO_PORTC_BASE, 0xF0);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTD_BASE, 0xFE);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, 0x01);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTE_BASE, 0xDC);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, 0x23);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTF_BASE, 0x07);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, 0x38);

    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTG_BASE, 0x83);

    ROM_GPIOPinTypeGPIOInput(GPIO_PORTH_BASE, 0x7F);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTH_BASE, 0x80);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTJ_BASE, 0x02);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTJ_BASE, 0x05);

    //*****************************************************************************
    // Interrupt Settings
    //*****************************************************************************
	ROM_GPIOIntTypeSet(PIN_W_LCL_DATA_BASE, PIN_W_LCL_DATA_PIN, GPIO_FALLING_EDGE);
	ROM_GPIOIntTypeSet(PIN_W_LCR_DATA_BASE, PIN_W_LCR_DATA_PIN, GPIO_FALLING_EDGE);

	ROM_GPIOPinIntEnable(PIN_W_LCL_DATA_BASE, PIN_W_LCL_DATA_PIN);
	ROM_GPIOPinIntEnable(PIN_W_LCR_DATA_BASE, PIN_W_LCR_DATA_PIN);

    //*****************************************************************************
    // Timer 0 Setup
    //*****************************************************************************
    // Configure Timer0 as 32-bit periodic timer
    TimerConfigure(TIMER0_BASE, TIMER_CFG_32_BIT_PER);
    // Set Timer0 period as 1/1000 of the system clock, i.e. 1000 interrupts per second
    TimerLoadSet(TIMER0_BASE, TIMER_A, SysCtlClockGet() / 1000);
    // Configure the timer to generate an interrupt on time-out
    TimerIntEnable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
    // Enable the TImer Interrupt in the NVIC
    IntEnable(INT_TIMER0A);
    // Enable the timer
    TimerEnable(TIMER0_BASE, TIMER_A);

    //*****************************************************************************
    // Timer 1 Setup
    //*****************************************************************************
    // Configure Timer0 as 32-bit periodic timer
    TimerConfigure(TIMER1_BASE, TIMER_CFG_32_BIT_PER);
    // Set Timer0 period as 1/10000 of the system clock, i.e. 10000 interrupts per second
    TimerLoadSet(TIMER1_BASE, TIMER_A, SysCtlClockGet() / 10000);
    // Configure the timer to generate an interrupt on time-out
    TimerIntEnable(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    // Enable the timer Interrupt in the NVIC
    IntEnable(INT_TIMER1A);
    // Enable the timer
    TimerEnable(TIMER1_BASE, TIMER_A);

    //*****************************************************************************
    // UART Setup
    //*****************************************************************************
 	GPIOPinConfigure(GPIO_PA1_U0TX);
 	GPIOPinConfigure(GPIO_PA0_U0RX);

	ROM_GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 |
						GPIO_PIN_1);

	ROM_UARTConfigSetExpClk(UART0_BASE, ROM_SysCtlClockGet(), 115200,
							(UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
							 UART_CONFIG_PAR_NONE));

    // Configuring the UART interrupt.
	//ROM_UARTFIFOLevelSet(UART0_BASE, UART_FIFO_TX1_8, UART_FIFO_RX1_8);
	UARTTxIntModeSet(UART0_BASE, UART_TXINT_MODE_EOT);
    ROM_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_TX);
    ROM_IntEnable(INT_UART0);

    // Enable the UART.
    UARTEnable(UART0_BASE);

    // Unfortunately, in StellarisWare, UARTEnable() silently re-enables the FIFO,
    // so to get rid of that, move UARTFIFODisable() call after UARTEnable()
    UARTFIFODisable(UART0_BASE);

    //*****************************************************************************
    // SSI Setup
    //*****************************************************************************

    GPIOPinConfigure(GPIO_PA2_SSI0CLK);
    GPIOPinConfigure(GPIO_PA3_SSI0FSS);
    GPIOPinConfigure(GPIO_PA4_SSI0RX);
    GPIOPinConfigure(GPIO_PA5_SSI0TX);
    ROM_GPIOPinTypeSSI(PORT_SSI_CLK_BASE, PORT_SSI_CLK_PIN | PORT_SSI_FSS_PIN |
                   PIN_SSI_RX_PIN | PORT_SSI_TX_PIN);

    SSIConfigSetExpClk(SSI0_BASE, SysCtlClockGet(), SSI_FRF_MOTO_MODE_0,
                       SSI_MODE_MASTER, 125000, 8);

    SSIEnable(SSI0_BASE);

    // Clear SPI Buffer
    while(SSIDataGetNonBlocking(SSI0_BASE, &SPIIn[0]))
    {
    }

    /* switch to interrupt driven SPI */

    SSIIntDisable(SSI0_BASE, SSI_TXFF | SSI_RXFF | SSI_RXTO | SSI_RXOR );
    SSIIntClear(SSI0_BASE, SSI_TXFF | SSI_RXFF | SSI_RXTO | SSI_RXOR );

    HWREG(SSI0_BASE + SSI_O_CR1) |= SSI_CR1_EOT; /* switch tx interrupt to eot int */

    SSIIntEnable(SSI0_BASE, SSI_TXFF ); /* SSI_TXFF | SSI_RXFF | SSI_RXTO | SSI_RXOR  */

    ROM_IntEnable(INT_SSI0);

    // Enable Interrupt
    ROM_IntMasterEnable();

	//ROM_IntEnable(INT_GPIOC);
    ROM_IntEnable(INT_GPIOD);
	ROM_IntEnable(INT_GPIOE);
	//ROM_IntEnable(INT_GPIOH);

	// Init
	GTInFillGripPneuValve = TRUE;	// Grip Open
	GTOutFillGripPneuValve = TRUE;	// Grip Open
    while(1)
    {
    	LoopCycle++;
    	if(ITMotorTrayElevatorDirSet)
    	{
    		DirUP = TRUE;
    		DirDOWN = FALSE;
    	}
    	else
    	{
    		DirUP = FALSE;
    		DirDOWN = TRUE;
    	}

        /* Load Cell Reading v */
        WLCLTempReading = 0;
        for(i = 0; i < WLCLLoadSampling; i++)
        {
        	WLCLTempReading += WLCLSDAReadingBuffer[i];
            if(i == (WLCLLoadSampling - 1))
            {
            	WLCLSDAReadingAverage = WLCLTempReading / WLCLLoadSampling;
            }
        }
        WLCLSDAReadingNormalised = ( (WLCLSDAReadingAverage * 250) / WLCLSDARatioCustomKg) - WLCLSDAReadingOffset;

        if( ((WLCLDispWeight * 10) - WLCLSDAReadingNormalised > 8) || ((WLCLDispWeight * 10) - WLCLSDAReadingNormalised < 0) )
        	WLCLDispWeight = WLCLSDAReadingNormalised / 10;

