Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
        if(WLCLDispWeight > 9999)
        	WLCLDispWeight = 9999;

        WLCRTempReading = 0;
        for(i = 0; i < WLCRLoadSampling; i++)
        {
        	WLCRTempReading += WLCRSDAReadingBuffer[i];
            if(i == (WLCRLoadSampling - 1))
            {
            	WLCRSDAReadingAverage = WLCRTempReading / WLCRLoadSampling;
            }
        }
        WLCRSDAReadingNormalised = ( (WLCRSDAReadingAverage * 250) / WLCRSDARatioCustomKg) - WLCRSDAReadingOffset;

        if( ((WLCRDispWeight * 10) - WLCRSDAReadingNormalised > 8) || ((WLCRDispWeight * 10) - WLCRSDAReadingNormalised < 0) )
        	WLCRDispWeight = WLCRSDAReadingNormalised / 10;

        if(WLCRDispWeight > 9999)
        	WLCRDispWeight = 9999;
        /* Load Cell Reading ^ */

        // Weigher Module : Weighing, and passing to filling bucket
        if( (MachineRunning && (!MachineStopping)) || WSoloEnable )
        {
        	// Left Weigher Module
            if(WLCLSDAReadingNormalised < ((WLCLTargetWeight - WLCLCorrectionWeight)* 10))
            {
                if(!WLCLWeightOK)                                // After Weight OK, Always Close Gate)
                {
                	if(WLCLSlowAt)
                	{
                		WLLrGatePneuValve = TRUE;
                		WLSmGatePneuValve = TRUE;
                	}
                	else
                	{
                    	WLLrGatePneuValve = FALSE;
                    	WLSmGatePneuValve = TRUE;
                	}
                    if(WLCLSDAReadingNormalised > (WLCLSlowAt * 10))
                    {
                    	WLLrGatePneuValve = FALSE;
                    	WLSmGatePneuValve = TRUE;
                    }
                    WLCLWeightOKFlag = FALSE;
                }
            }
            else    // Target Weight achieved
            {
            	WLLrGatePneuValve = FALSE;
            	WLSmGatePneuValve = FALSE;
            	// Still buffered for 200ms, then become WLCLWeightOK
                WLCLWeightOKFlag = TRUE;
            }
            // Right Weigher Module
            if(WLCRSDAReadingNormalised < ((WLCRTargetWeight - WLCRCorrectionWeight)* 10))
            {
                if(!WLCRWeightOK)                                // After Weight OK, Always Close Gate)
                {
                	if(WLCRSlowAt)
                	{
                		WRLrGatePneuValve = TRUE;
                		WRSmGatePneuValve = TRUE;
                	}
                	else
                	{
                    	WRLrGatePneuValve = FALSE;
                    	WRSmGatePneuValve = TRUE;
                	}
                    if(WLCRSDAReadingNormalised > (WLCRSlowAt * 10))
                    {
                    	WRLrGatePneuValve = FALSE;
                    	WRSmGatePneuValve = TRUE;
                    }
                    WLCRWeightOKFlag = FALSE;
                }
            }
            else    // Target Weight achieved
            {
            	WRLrGatePneuValve = FALSE;
            	WRSmGatePneuValve = FALSE;
            	// Still buffered for 200ms, then become WLCRWeightOK
                WLCRWeightOKFlag = TRUE;
            }
        }

        // Turn OFF Gates when WSoloEnable just DISABLED
        if(LastWSoloEnable != WSoloEnable)
        	if(!WSoloEnable)
        	{
            	WLLrGatePneuValve = FALSE;
            	WLSmGatePneuValve = FALSE;
            	WRLrGatePneuValve = FALSE;
            	WRSmGatePneuValve = FALSE;
            	WLCLWeightOKFlag = FALSE;
            	WLCRWeightOKFlag = FALSE;
            	WLCLWeightOK = FALSE;
            	WLCRWeightOK = FALSE;
        	}
        LastWSoloEnable = WSoloEnable;

        // Output to OF Module when there is request
        if(WLCRWeightOK || WLCLWeightOK)
        {
        	if(OFRequestFilling || WSoloOpenGate)
        	{
        		// To make more balance, if both okay, then alternate
        		if(WLCLWeightOK && WLCRWeightOK)
        		{
        			if(WLCNextGatePriority == 1)
        			{
        				// Right Gate Opens
        				WROpGatePneuDurationCounter = WROpGatePneuDuration;
        				WLCNextGatePriority = 0;//Next is LEFT;
        			}
        			else
        			{
        				// Left Gate Opens
        				WLOpGatePneuDurationCounter = WLOpGatePneuDuration;
        				WLCNextGatePriority = 1;//Next is RIGHT;
        			}
        		}
        		else if(WLCLWeightOK)
				{
        			// Left Gate Opens
        			WLOpGatePneuDurationCounter = WLOpGatePneuDuration;
        			WLCNextGatePriority = 1;////Next is RIGHT;
				}
				else if(WLCRWeightOK)
				{
					// Right Gate Opens
					WROpGatePneuDurationCounter = WROpGatePneuDuration;
					WLCNextGatePriority = 0;////Next is LEFT;
				}

				OFRequestFilling = FALSE;
				WSoloOpenGate = FALSE;
        	}
        }
        /* Weigher Module Operation Program ^ */

        /* Control Program v */
        if((!ServiceMode) && (ComFlag))                                                                               // Operation Page (Not Service Mode)
        {
            if(!MachineRunning)                                                                          // when machine is not running
            {
            	// If Machine is not busy, RunBtn, InitMON is available
            	if( (!Initting) && (!WLCLZeroMONFlag) && (!WLCRZeroMONFlag) )
            	{
					if( RunBtn ) // (!PINBTNRUN)
					{

						TRSbsMode = FALSE;
						GTSbsMode = FALSE;
						OFSbsMode = FALSE;
						SPSbsMode = FALSE;
						MachineRunning = TRUE;
						WLCLWeightOKCounter = 200;
						WLCRWeightOKCounter = 200;
						if( (!TRModuleStep) && (!GTModuleStep) && (!OFModuleStep) && (!SPModuleStep) )
						{
							TRModuleWaiting = FALSE;
							TRModuleWaitingPick = FALSE;
							GTSA1ModuleWaiting = FALSE;
							GTSA2ModuleWaiting = FALSE;
							OFModuleWaiting = FALSE;
							GTRequestFilling = FALSE;
						}

						RunBtn = FALSE;
					}
					if( InitMON )
					{
						Initting = TRUE;
						TRInitting = TRUE;
						GTInitting = TRUE;
						OFInitting = TRUE;
						SPInitting = TRUE;
						TRInitError = 0;
						GTInitError = 0;
						OFInitError = 0;
						SPInitError = 0;
						InitMON = FALSE;
					}
            	}
            }
            else                                                                                                    // when machine is RUNNING
            {
                if( StopBtn ) //|| Error)         // Motor OFF Btn/Inching pushed or Error Triggered
                {
                	MachineStopping = TRUE;
                	WLLrGatePneuValve = FALSE;
					WLSmGatePneuValve = FALSE;
					WRLrGatePneuValve = FALSE;
					WRSmGatePneuValve = FALSE;
                	WLCLWeightOK = FALSE;
                	WLCRWeightOK = FALSE;
                	StopBtn = FALSE;
                	/*
                    if(StopCommand == FALSE)                                              // Stop the machine at designated STOP AT position
                    {
                        StopCommand = TRUE;
                    }*/
                }
                if(FatalError)
                {
                    MachineRunning = FALSE;
                }
            }
        }
        if(Initting)
        {
        	if( (!TRInitting) && (!GTInitting) && (!OFInitting) && (!SPInitting) )
        	{
        		Initting = FALSE;
        		GTSA1ModuleWaiting = FALSE;
        		GTSA2ModuleWaiting = FALSE;
        		OFModuleWaiting = FALSE;
        		TRModuleWaiting = FALSE;
        		TRModuleWaitingPick = FALSE;
        		TRInitErrorResult = TRInitError;
        		GTInitErrorResult = GTInitError;
        		OFInitErrorResult = OFInitError;
        		SPInitErrorResult = SPInitError;
        		GTFirstCycle = TRUE;
        	}
        }
        if(MachineStopping)
        {
        	if( (!TRModuleStep) && (!GTModuleStep) && (!OFModuleStep) && (!SPModuleStep) )
        	{
        		MachineStopping = FALSE;
        		MachineRunning = FALSE;
            	WLLrGatePneuValve = FALSE;
				WLSmGatePneuValve = FALSE;
				WRLrGatePneuValve = FALSE;
				WRSmGatePneuValve = FALSE;
        		GTSA1ModuleWaiting = FALSE;
        		GTSA2ModuleWaiting = FALSE;
        		OFModuleWaiting = FALSE;
        		TRModuleWaiting = FALSE;
        		TRModuleWaitingPick = FALSE;
        		GTFirstCycle = TRUE;
        	}
        }

