Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
        //FoilSub();                                                                        // Motor Foil Subroutine
        /* Control Program ^ */

        /* Error Identifier v */

        if(NoAirError)
            FatalError = TRUE;
        else
            FatalError = FALSE;

        if(HeaterError || DoorOpen || FoilEmpty )
            Error = TRUE;
        else
            Error = FALSE;

        /* Error Identifier ^ */

        /* Error Handler v */

        if(Error || FatalError || HeaterErrorMsg || FoilJamMsg || NoAirErrorMsg)
        {
            if(BlinkFlag)                           // Warning, took DoorOpen place in com
                BlinkCom = TRUE;
            else
                BlinkCom = FALSE;
        }
        else
            BlinkCom = FALSE;

        /* Error Handler ^ */
        if(ReadACK)
        {
            if(DataReady)
            {
                DataLock = TRUE;
				while( dataTXIndex <= ((ComAddress * 20) + (BytestoRead) + 5 - 1) )
				{
					ROM_UARTCharPut(UART0_BASE, ComOUT[dataTXIndex]);
					dataTXIndex++;
				}
				DataLock = FALSE;
				ReadACK = FALSE;
				dataTXIndex = ComAddress * 20;
            }
            else
                DataTimerTrigger = TRUE;                        // Activate the transfer manually
        }

    	// UART Communication Subroutine
        if(DataLock == FALSE)
        {   //Init Page ComOUT[0] - ComOUT[19]
            DataReady = FALSE;
            ComOUT[0]= 0xF0;              // Start
            // OUT: Position: Station No = 0
            ComOUT[1]= 0x01;
            // OUT: Function: Number 3
            ComOUT[2]= 0x03;
            // OUT : END
            ComOUT[3] = 0x0F;
            ComOUT[4] = 0x0F;

            //Main Page ComOUT[20] - ComOUT[39]
            ComOUT[20] = 0xF0;              // Start
            // OUT: Position: Station No = 0
            ComOUT[21] = 0x01;
            // OUT: Function: Number 3
            ComOUT[22] = 0x03;
            // OUT: Data
            ComOUT[23] = MachineRunning + (BlinkCom << 1) + (ProductCountBit << 2) + (GTFirstCycle << 3) + (MachineStopping << 4) + (Initting << 5) + (BlinkFlag << 6);
            ComOUT[24] = HeaterErrorMsg + (EyemarkError << 1) + (DoorOpen << 2) + (SPIComError << 3) + (NoAirErrorMsg << 4)  + (DatesensError << 5);
            ComOUT[25] = ITMotorTrayElevator + (ITMotorTrayElevatorDir << 1) + (ITValveTrayPos << 2) + (ITReady << 3);
            ComOUT[26] = TRExtenderPneuValve + (TRReorientPneuValve << 1) + (TRVacuumValve << 2) + (GTFPushPneuValve << 3) + (TRModuleWaiting << 4);
            ComOUT[27] = GTInFillGripPneuValve + (GTOutFillOpenPneuValve << 1) + (GTOutFillGripPneuValve << 2) + (GTTransferPneuValve << 3) + (GTSA1ModuleWaiting << 4) + (GTSA2ModuleWaiting << 5) + (GTRequestFilling << 6);
            ComOUT[28] = OFGatePneuValve + (OFEngagePneuValve << 1) + (OFOpenPneuValve << 2) + (OFVacuumValve << 3) + (VFVibEngagePneuValve << 4) + (VFVibrator << 5) + (OFGatePneuFilled << 6) + (OFGatePneuFillingProcess << 7);
            ComOUT[29] = OFModuleWaiting;
            ComOUT[30] = SPSealerPneuValve + (SPVibEngagePneuValve << 1) + (SPPusherValve << 2) + (SPVibrator << 3) + (WLCLWeightOK << 6) + (WLCRWeightOK << 7);
            ComOUT[31] = WLLrGatePneuValve + (WLSmGatePneuValve << 1) + (WLOpGatePneuValve << 2) + (WRLrGatePneuValve << 3) + (WRSmGatePneuValve << 4) + (WROpGatePneuValve << 5) + (WLCLCalibrationFlag << 6) + (WLCRCalibrationFlag << 7);
            // All Pins Master
            ComOUT[32] = ROM_GPIOPinRead(GPIO_PORTA_BASE, 0xFF);
            ComOUT[33] = ROM_GPIOPinRead(GPIO_PORTB_BASE, 0xFF);
            ComOUT[34] = ROM_GPIOPinRead(GPIO_PORTC_BASE, 0xFF);
            ComOUT[35] = ROM_GPIOPinRead(GPIO_PORTD_BASE, 0xFF);
            ComOUT[36] = ROM_GPIOPinRead(GPIO_PORTE_BASE, 0xFF);
            ComOUT[37] = ROM_GPIOPinRead(GPIO_PORTF_BASE, 0xFF);
            ComOUT[38] = ROM_GPIOPinRead(GPIO_PORTG_BASE, 0xFF);
            ComOUT[39] = ROM_GPIOPinRead(GPIO_PORTH_BASE, 0xFF);
            ComOUT[41] = ROM_GPIOPinRead(GPIO_PORTJ_BASE, 0xFF);
            // All Pins Slave
            ComOUT[42] = SlavePortA;
            ComOUT[43] = SlavePortB;
            ComOUT[44] = SlavePortC;
            ComOUT[45] = SlavePortD;
            ComOUT[46] = SlavePortE;
            ComOUT[47] = SlavePortF;
            ComOUT[48] = SlavePortG;
            ComOUT[49] = SlavePortH;
            ComOUT[50] = SlavePortI;
            ComOUT[51] = SlavePortJ;

            ComOUT[52] = ITSwitchTrayStep;
            ComOUT[53] = TRModuleStep;
            ComOUT[54] = TRVacuumValveDelayCounter / 10;
            ComOUT[55] = GTModuleStep;
            ComOUT[56] = GTCloseBagDelayCounter / 10;
            ComOUT[57] = GTBothOpenGripDelayCounter / 10;
            ComOUT[58] = OFModuleStep;
            ComOUT[59] = OFGatePneuValveDurationCounter / 10;
            ComOUT[60] = OFVacuumValveDelayCounter / 10;
            ComOUT[61] = SPModuleStep;
            ComOUT[62] = SPSealerPneuValveDelayCounter / 10;
            ComOUT[63] = SPSealerPneuValveDurationCounter / 10;
            ComOUT[64] = WLOpGatePneuDurationCounter / 10;
            ComOUT[65] = WROpGatePneuDurationCounter / 10;

            ComOUT[66] = WNextOpGateDelayCounter / 10;
            ComOUT[67] = WLCLSDARatioCustomKgCO >> 24;			// Com Out
            ComOUT[68] = WLCLSDARatioCustomKgCO >> 16;			// Com Out
            ComOUT[69] = WLCLSDARatioCustomKgCO >> 8;			// Com Out
            ComOUT[70] = WLCLSDARatioCustomKgCO;				// Com Out
            ComOUT[71] = WLCRSDARatioCustomKgCO >> 24;
            ComOUT[72] = WLCRSDARatioCustomKgCO >> 16;
            ComOUT[73] = WLCRSDARatioCustomKgCO >> 8;
			ComOUT[74] = WLCRSDARatioCustomKgCO;

			ComOUT[75] = WLCLSDAReadingOffsetCO >> 24;
			ComOUT[76] = WLCLSDAReadingOffsetCO >> 16;
			ComOUT[77] = WLCLSDAReadingOffsetCO >> 8;
			ComOUT[78] = WLCLSDAReadingOffsetCO;
			ComOUT[79] = WLCRSDAReadingOffsetCO >> 24;
			ComOUT[80] = WLCRSDAReadingOffsetCO >> 16;
			ComOUT[81] = WLCRSDAReadingOffsetCO >> 8;
			ComOUT[82] = WLCRSDAReadingOffsetCO;

			ComOUT[83] = WLCLDispWeight >> 24;
			ComOUT[84] = WLCLDispWeight >> 16;
			ComOUT[85] = WLCLDispWeight >> 8;
			ComOUT[86] = WLCLDispWeight;
			ComOUT[87] = WLCRDispWeight >> 24;
			ComOUT[88] = WLCRDispWeight >> 16;
			ComOUT[89] = WLCRDispWeight >> 8;
			ComOUT[90] = WLCRDispWeight;

			ComOUT[91] = WLCLSDAReading >> 24;
			ComOUT[92] = WLCLSDAReading >> 16;
			ComOUT[93] = WLCLSDAReading >> 8;
			ComOUT[94] = WLCLSDAReading;
			ComOUT[95] = WLCRSDAReading >> 24;
			ComOUT[96] = WLCRSDAReading >> 16;
			ComOUT[97] = WLCRSDAReading >> 8;
			ComOUT[98] = WLCRSDAReading;

			ComOUT[99] = GTFPushPneuValveDurationCounter / 10;
			ComOUT[100] = UNUSED;

			ComOUT[101] = LoopTime >> 8;
			ComOUT[102] = LoopTime;
			ComOUT[103] = LifeDuration >> 24;
			ComOUT[104] = LifeDuration >> 16;
			ComOUT[105] = LifeDuration >> 8;
			ComOUT[106] = LifeDuration;
			ComOUT[107] = 13;				// Program Version

			ComOUT[108] = TRInitErrorResult >> 8;
			ComOUT[109] = TRInitErrorResult;
			ComOUT[110] = GTInitErrorResult >> 8;
			ComOUT[111] = GTInitErrorResult;

			ComOUT[112] = OFInitErrorResult >> 8;
			ComOUT[113] = OFInitErrorResult;
			ComOUT[114] = SPInitErrorResult >> 8;
			ComOUT[115] = SPInitErrorResult;

            ComOUT[116] = VFVibratorEngageDelayCounter / 10;
            ComOUT[117] = VFVibratorEngageVibDelayCounter / 10;
            // OUT : END
            ComOUT[128] = 0x0F;
            ComOUT[129] = 0x0F;
            DataReady = TRUE;
        }

    	// SPI Communication Subroutine
        if(!SPIDataLock)
        {
            SPIDataReady = FALSE;
            SPIOut[0] = 0xF0;
            SPIOut[1] = 0x64;
            SPIOut[2] = 0x04;
            SPIOut[3] = ITMotorTrayElevator + ( ITMotorTrayElevatorDir << 1 ) + ( ITValveTrayPos << 2 );
            SPIOut[4] = GTInFillGripPneuValve + ( GTOutFillOpenPneuValve << 1 ) + ( GTOutFillGripPneuValve << 2 ) + ( GTTransferPneuValve << 3 );
            SPIOut[5] = VFVibEngagePneuValve + ( VFVibrator << 1 );
            SPIOut[6] = SPVibEngagePneuValve + ( SPPusherValve << 1 ) + ( SPVibrator << 2 );
            SPIOut[7] = BufferSensor >> 8;
            SPIOut[8] = BufferSensor;
            SPIOut[9] = TowerLightGreen + ( TowerLightYellow << 1 ) + ( TowerLightRed << 2 );
            SPIOut[24] = 0x0F;
            SPIOut[25] = 0x0F;
            SPIDataReady = TRUE;
        }
    }
}
